const CITIES = document.getElementById("cch");

Chart.defaults.global.animation.duration = 3000;
Chart.defaults.scale.ticks.beginAtZero = true;


let cities_chart = new Chart(CITIES, {
    type: 'bubble',
	data: {
		datasets: [
			{label:['Абакан: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.15496739958,'y':0.140545688713,'r':10}]
			},
			{label:['Агинское: 1'],
			backgroundColor:'#7fc4f3',
			data:[{'x':0.841283538915,'y':0.57561403813,'r':5}]
			},
			{label:['Актобе: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.618536875426,'y':0.49537999442,'r':5}]
			},
			{label:['Алексин: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.549083962309,'y':0.356498069367,'r':5}]
			},
			{label:['Алеховщина: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.404916004279,'y':0.909554455896,'r':5}]
			},
			{label:['Алматы: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.491562899417,'y':0.231767569734,'r':15}]
			},
			{label:['Алушта: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.519721152172,'y':0.783869586129,'r':5}]
			},
			{label:['Альметьевск: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.788186636084,'y':0.931370710983,'r':5}]
			},
			{label:['Анапа: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.490305323865,'y':0.564313264558,'r':10}]
			},
			{label:['Апатиты: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.489856675464,'y':0.351103801096,'r':5}]
			},
			{label:['Архангельск: 3'],
			backgroundColor:'#447c69',
			data:[{'x':0.651724007164,'y':0.418319757782,'r':15}]
			},
			{label:['Астрахань: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.237404740338,'y':0.205231217069,'r':5}]
			},
			{label:['Бабаево: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.166087619693,'y':0.211399442461,'r':5}]
			},
			{label:['Балаково: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.321169030542,'y':0.752622978991,'r':5}]
			},
			{label:['Балахна: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.135276748321,'y':0.159914634123,'r':5}]
			},
			{label:['Балашиха: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.392734998738,'y':0.837804033911,'r':10}]
			},
			{label:['Балтийск: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.0515438973918,'y':0.319253454191,'r':5}]
			},
			{label:['Барнаул: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.12397277083,'y':0.666700534336,'r':10}]
			},
			{label:['Белгород: 8'],
			backgroundColor:'#be5168',
			data:[{'x':0.629033389369,'y':0.1369004389,'r':40}]
			},
			{label:['Бердск: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.0596857191434,'y':0.946430892695,'r':5}]
			},
			{label:['Березники: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.181748595321,'y':0.354403060607,'r':10}]
			},
			{label:['Большие Колпаны: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.788888144133,'y':0.937542758246,'r':5}]
			},
			{label:['Брест: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.781026840401,'y':0.944066146955,'r':5}]
			},
			{label:['Брехово: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.681914751781,'y':0.997384589168,'r':5}]
			},
			{label:['Брянка: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.841010369603,'y':0.277693606649,'r':5}]
			},
			{label:['Брянск: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.35,'y':0.520577824378,'r':10}]
			},
			{label:['Вельск: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.7343073729,'y':0.96462273863,'r':5}]
			},
			{label:['Верхнедвинск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.149814100331,'y':0.567143356134,'r':5}]
			},
			{label:['Витебск: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.772499547917,'y':0.107405515483,'r':5}]
			},
			{label:['Владивосток: 4'],
			backgroundColor:'#e279a3',
			data:[{'x':0.98558433633,'y':0.378856805749,'r':20}]
			},
			{label:['Владимир: 3'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0776468694484,'y':0.68259372834,'r':15}]
			},
			{label:['Волгоград: 4'],
			backgroundColor:'#74c493',
			data:[{'x':0.356532087488,'y':0.957241296863,'r':20}]
			},
			{label:['Волжский: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.992782137224,'y':0.313961559845,'r':5}]
			},
			{label:['Вологда: 4'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.381670530784,'y':0.518304781177,'r':20}]
			},
			{label:['Волосово: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.287944848516,'y':0.359242873342,'r':5}]
			},
			{label:['Воркута: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.126194779114,'y':0.602604525172,'r':5}]
			},
			{label:['Воронеж: 6'],
			backgroundColor:'#e16552',
			data:[{'x':0.514216474296,'y':0.110124770418,'r':30}]
			},
			{label:['Выборг: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.583800297831,'y':0.256748025439,'r':5}]
			},
			{label:['Вязьма: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.927479502661,'y':0.983289538147,'r':5}]
			},
			{label:['Гатчина: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.8165223139,'y':0.339035580029,'r':5}]
			},
			{label:['Георгиевск: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.566904865906,'y':0.701754356895,'r':5}]
			},
			{label:['Гродно: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.312342127816,'y':0.417436520122,'r':5}]
			},
			{label:['Данилов: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.0330959998664,'y':0.10232070591,'r':5}]
			},
			{label:['Дзержинск: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.841736204158,'y':0.236672959952,'r':5}]
			},
			{label:['Дмитров: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.506165531019,'y':0.884287447609,'r':5}]
			},
			{label:['Домодедово: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.716055060715,'y':0.799100524288,'r':10}]
			},
			{label:['Донецк: 3'],
			backgroundColor:'#be5168',
			data:[{'x':0.00828994508307,'y':0.864818667912,'r':15}]
			},
			{label:['Дружковка: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.175690241472,'y':0.523066321902,'r':5}]
			},
			{label:['Дубна: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.299172858453,'y':0.425015869318,'r':5}]
			},
			{label:['Екатеринбург: 22'],
			backgroundColor:'#993767',
			data:[{'x':0.990729434823,'y':0.824706289083,'r':110}]
			},
			{label:['Елабуга: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.0488279193884,'y':0.8059816477,'r':5}]
			},
			{label:['Железнодорожный (Балашиха): 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.3004793011,'y':0.871775841729,'r':5}]
			},
			{label:['Зайсан: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.744358080826,'y':0.426817225145,'r':5}]
			},
			{label:['Запорожье: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.980993845124,'y':0.958119130123,'r':10}]
			},
			{label:['Заречное: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.106727113461,'y':0.827210253375,'r':5}]
			},
			{label:['Зеленоград: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.503677235405,'y':0.0531600595544,'r':10}]
			},
			{label:['Златоуст: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.731373759145,'y':0.012138249526,'r':10}]
			},
			{label:['Знаменск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.131816430167,'y':0.15,'r':5}]
			},
			{label:['Иваново: 3'],
			backgroundColor:'#447c69',
			data:[{'x':0.91939544601,'y':0.551876817488,'r':15}]
			},
			{label:['Ижевск: 6'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.352991604777,'y':0.584725909233,'r':30}]
			},
			{label:['Иркутск: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.976833206277,'y':0.0257594575421,'r':5}]
			},
			{label:['Йошкар-Ола: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.955013327538,'y':0.813618140763,'r':10}]
			},
			{label:['Кагул: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.320362278089,'y':0.846664662534,'r':5}]
			},
			{label:['Казань: 6'],
			backgroundColor:'#5698c4',
			data:[{'x':0.0541726734254,'y':0.78274051268,'r':30}]
			},
			{label:['Калининград: 11'],
			backgroundColor:'#be5168',
			data:[{'x':0.129178427381,'y':0.94,'r':55}]
			},
			{label:['Калуга: 3'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.385571850139,'y':0.385221713392,'r':15}]
			},
			{label:['Камышин: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.823438777931,'y':0.111032825435,'r':5}]
			},
			{label:['Караганда: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.665940657921,'y':0.609039707068,'r':5}]
			},
			{label:['Кемерово: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.793325764201,'y':0.774327007277,'r':10}]
			},
			{label:['Киев: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.682131805624,'y':0.749969122529,'r':20}]
			},
			{label:['Киржач: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.134920482147,'y':0.538040774145,'r':5}]
			},
			{label:['Кириши: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.693906501965,'y':0.128885097863,'r':15}]
			},
			{label:['Киров: 5'],
			backgroundColor:'#e16552',
			data:[{'x':0.597940796019,'y':0.806319568153,'r':25}]
			},
			{label:['Ковдор: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.248615067472,'y':0.430154726713,'r':5}]
			},
			{label:['Ковров: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.92941681231,'y':0.706144836693,'r':10}]
			},
			{label:['Коломна: 3'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.336504897569,'y':0.424777090447,'r':15}]
			},
			{label:['Копейск: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.573859621481,'y':0.715020292072,'r':5}]
			},
			{label:['Королёв: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.40822981463,'y':0.0776658675436,'r':10}]
			},
			{label:['Костомукша: 7'],
			backgroundColor:'#4e2472',
			data:[{'x':0.33995617293,'y':0.161050939162,'r':35}]
			},
			{label:['Кострома: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.389570629809,'y':0.0880631582096,'r':5}]
			},
			{label:['Красногорск: 3'],
			backgroundColor:'#447c69',
			data:[{'x':0.367448821492,'y':0.350153110011,'r':15}]
			},
			{label:['Краснодар: 8'],
			backgroundColor:'#5698c4',
			data:[{'x':0.564893887338,'y':0.277618249017,'r':40}]
			},
			{label:['Краснодон: 4'],
			backgroundColor:'#f19670',
			data:[{'x':0.489840328196,'y':0.168149349026,'r':20}]
			},
			{label:['Краснознаменск: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.673186741449,'y':0.464042179576,'r':10}]
			},
			{label:['Красноярск: 6'],
			backgroundColor:'#9163b6',
			data:[{'x':0.464595301714,'y':0.893502207808,'r':30}]
			},
			{label:['Крестцы: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.827525843205,'y':0.187626450163,'r':5}]
			},
			{label:['Кривой Рог: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.123159870428,'y':0.742787209212,'r':10}]
			},
			{label:['Кстово: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.937441537086,'y':0.95392486259,'r':5}]
			},
			{label:['Кумертау: 3'],
			backgroundColor:'#9abf88',
			data:[{'x':0.57757021841,'y':0.00972722560727,'r':15}]
			},
			{label:['Курган: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.659822676087,'y':0.401212892662,'r':5}]
			},
			{label:['Курск: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.351023033425,'y':0.58255475848,'r':5}]
			},
			{label:['Лангепас: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.94098976866,'y':0.589040659946,'r':5}]
			},
			{label:['Лахденпохья: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.847551420722,'y':0.829946938585,'r':5}]
			},
			{label:['Лесной: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.413786255844,'y':0.257582999731,'r':5}]
			},
			{label:['Ливны: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.887417105194,'y':0.755668661734,'r':5}]
			},
			{label:['Ликино-Дулево: 3'],
			backgroundColor:'#e279a3',
			data:[{'x':0.712511667763,'y':0.497866688593,'r':15}]
			},
			{label:['Липецк: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.561551816641,'y':0.941812527384,'r':10}]
			},
			{label:['Лобня: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.929098256363,'y':0.862276942219,'r':5}]
			},
			{label:['Лосино-Петровский: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.689535090799,'y':0.827030094002,'r':5}]
			},
			{label:['Луховицы: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.127412961737,'y':0.0998472345633,'r':5}]
			},
			{label:['Львов: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.780386190479,'y':0.868828547671,'r':5}]
			},
			{label:['Люберцы: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.0978519943525,'y':0.108842360254,'r':10}]
			},
			{label:['Людиново: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.784464985018,'y':0.87164722037,'r':10}]
			},
			{label:['Магадан: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.935167098949,'y':0.752900664278,'r':5}]
			},
			{label:['Магнитогорск: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.245167654033,'y':0.525970725685,'r':5}]
			},
			{label:['Малин: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.878553589744,'y':0.296550987761,'r':5}]
			},
			{label:['Медвежий Угол: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.85379552658,'y':0.0104158402562,'r':5}]
			},
			{label:['Мелеуз: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.667239721041,'y':0.871830415051,'r':5}]
			},
			{label:['Минск: 5'],
			backgroundColor:'#c94a53',
			data:[{'x':0.326480227338,'y':0.887282372384,'r':25}]
			},
			{label:['Мирный: 2'],
			backgroundColor:'#a34974',
			data:[{'x':0.159051664481,'y':0.696323817591,'r':10}]
			},
			{label:['Мончегорск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.227705026976,'y':0.16089871167,'r':5}]
			},
			{label:['Москва: 173'],
			backgroundColor:'#f19670',
			data:[{'x':0.47688756801,'y':0.70303556455,'r':173}]
			},
			{label:['Мурманск: 8'],
			backgroundColor:'#447c69',
			data:[{'x':0.0185575868491,'y':0.264759552186,'r':40}]
			},
			{label:['Мытищи: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.160426841057,'y':0.839617430801,'r':5}]
			},
			{label:['Набережные Челны: 4'],
			backgroundColor:'#a34974',
			data:[{'x':0.533586199377,'y':0.71622408715,'r':20}]
			},
			{label:['Навашино: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.320484844302,'y':0.130458606166,'r':5}]
			},
			{label:['Нарьян-Мар: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.3,'y':0.615735293473,'r':5}]
			},
			{label:['Нижневартовск: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.774659445596,'y':0.425449924549,'r':5}]
			},
			{label:['Нижнекамск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.251116582161,'y':0.681951178742,'r':5}]
			},
			{label:['Нижний Новгород: 19'],
			backgroundColor:'#74c493',
			data:[{'x':0.818593969846,'y':0.674546634694,'r':95}]
			},
			{label:['Нижний Тагил: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.423622841669,'y':0.912336373616,'r':10}]
			},
			{label:['Николаев: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.361179279706,'y':0.743723284413,'r':5}]
			},
			{label:['Нововоронеж: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.352973447006,'y':0.221383305035,'r':5}]
			},
			{label:['Новокузнецк: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.66986778777,'y':0.919009442422,'r':5}]
			},
			{label:['Новосибирск: 13'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.747791315045,'y':0.387679785469,'r':65}]
			},
			{label:['Новочебоксарск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.344488169063,'y':0.287219756255,'r':5}]
			},
			{label:['Ноябрьск: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0271751047168,'y':0.0653558634816,'r':5}]
			},
			{label:['Одесса: 3'],
			backgroundColor:'#65387d',
			data:[{'x':0.917220089013,'y':0.0881212154016,'r':15}]
			},
			{label:['Октябрьский: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.59439597288,'y':0.57,'r':5}]
			},
			{label:['Омск: 3'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.779009952117,'y':0.94509651608,'r':15}]
			},
			{label:['Оренбург: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.0486857467145,'y':0.969509475494,'r':5}]
			},
			{label:['Орехово-Зуево: 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.285549169385,'y':0.808826863997,'r':10}]
			},
			{label:['Орёл: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.582720355758,'y':0.962176579616,'r':10}]
			},
			{label:['Оханск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.160038557002,'y':0.772972923637,'r':5}]
			},
			{label:['Павловский Посад: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.283019693266,'y':0.759405647831,'r':5}]
			},
			{label:['Пенза: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.217048948404,'y':0.652169637746,'r':5}]
			},
			{label:['Пермь: 5'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.744808928769,'y':0.227732111302,'r':25}]
			},
			{label:['Петрозаводск: 4'],
			backgroundColor:'#e2975d',
			data:[{'x':0.22358243415,'y':0.927062303032,'r':20}]
			},
			{label:['Пинск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.591541281486,'y':0.0471231625891,'r':5}]
			},
			{label:['Питер: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.69859061938,'y':0.995203164343,'r':5}]
			},
			{label:['Полевской: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.984130656001,'y':0.576484717163,'r':5}]
			},
			{label:['Псков: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.439610323924,'y':0.662137817019,'r':20}]
			},
			{label:['Пудож: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.56424157539,'y':0.695229753271,'r':5}]
			},
			{label:['Пушкин: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.88,'y':0.4,'r':10}]
			},
			{label:['Раменское: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.680901713569,'y':0.69304019796,'r':5}]
			},
			{label:['Ревда: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.558679803941,'y':0.569770400617,'r':10}]
			},
			{label:['Ришон ЛеЦион: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.365574260977,'y':0.688807729538,'r':5}]
			},
			{label:['Ростов: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.896914811848,'y':0.981521619212,'r':5}]
			},
			{label:['Ростов-на-Дону: 8'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.865546042972,'y':0.914166049933,'r':40}]
			},
			{label:['Рыбинск: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.482109227941,'y':0.960643536767,'r':5}]
			},
			{label:['Рязань: 5'],
			backgroundColor:'#be5168',
			data:[{'x':0.538784304899,'y':0.628081841831,'r':25}]
			},
			{label:['Саки: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.981278391182,'y':0.489137672785,'r':5}]
			},
			{label:['Самара: 10'],
			backgroundColor:'#9abf88',
			data:[{'x':0.424453544451,'y':0.5,'r':50}]
			},
			{label:['Санкт-Петербург: 143'],
			backgroundColor:'#e2975d',
			data:[{'x':0.160499234817,'y':0.442644721289,'r':143}]
			},
			{label:['Саранск: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.16946104065,'y':0.86717076461,'r':5}]
			},
			{label:['Саратов: 11'],
			backgroundColor:'#74c493',
			data:[{'x':0.508561714458,'y':0.637038298886,'r':55}]
			},
			{label:['Севастополь: 5'],
			backgroundColor:'#e279a3',
			data:[{'x':0.199199174889,'y':0.328879192513,'r':25}]
			},
			{label:['Северодвинск: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.843611595303,'y':0.0125580347705,'r':5}]
			},
			{label:['Северская: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.930998922837,'y':0.966501477792,'r':5}]
			},
			{label:['Сегежа: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.187020570272,'y':0.0235496945492,'r':5}]
			},
			{label:['Селятино: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.745808295515,'y':0.338558321325,'r':5}]
			},
			{label:['Сергиев Посад: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.544771379149,'y':0.60216002793,'r':5}]
			},
			{label:['Сибай: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.455427052064,'y':0.897979009689,'r':5}]
			},
			{label:['Симферополь: 4'],
			backgroundColor:'#5698c4',
			data:[{'x':0.865574403565,'y':0.136982231802,'r':20}]
			},
			{label:['Сланцы: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.482202818652,'y':0.404955701814,'r':10}]
			},
			{label:['Смоленск: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.714370766315,'y':0.0821960143006,'r':10}]
			},
			{label:['Снегири: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.197985579176,'y':0.0883555592756,'r':5}]
			},
			{label:['Солигорск: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.472355985725,'y':0.110092970952,'r':5}]
			},
			{label:['Солнечногорск: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.134217593602,'y':0.511296195891,'r':5}]
			},
			{label:['Сосновый Бор: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.00230338896684,'y':0.883177179459,'r':5}]
			},
			{label:['Сочи: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.531835498457,'y':0.769362330727,'r':5}]
			},
			{label:['Спасское: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.290809265918,'y':0.678435181922,'r':5}]
			},
			{label:['Среднеуральск: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.165950488518,'y':0.135365897589,'r':10}]
			},
			{label:['Ставрополь: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0533544529461,'y':0.527661534763,'r':10}]
			},
			{label:['Старый Оскол: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.318119204815,'y':0.569805817201,'r':10}]
			},
			{label:['Стаханов: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.553024379184,'y':0.87,'r':5}]
			},
			{label:['Сумы: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.249529365961,'y':0.0311112051237,'r':5}]
			},
			{label:['Сухой Лог: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.270104299274,'y':0.922215764472,'r':5}]
			},
			{label:['Сызрань: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.0131694054894,'y':0.264096630621,'r':5}]
			},
			{label:['Сыктывкар: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.355647486682,'y':0.152973239437,'r':5}]
			},
			{label:['Тамбов: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.381168380785,'y':0.0396336022316,'r':5}]
			},
			{label:['Тверь: 4'],
			backgroundColor:'#c94a53',
			data:[{'x':0.513932981752,'y':0.610765258476,'r':20}]
			},
			{label:['Тирасполь: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.00153940816636,'y':0.287608314493,'r':10}]
			},
			{label:['Тихвин: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.536379197792,'y':0.0794647106801,'r':5}]
			},
			{label:['Тобольск: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.494845341063,'y':0.724105888274,'r':5}]
			},
			{label:['Толбазы: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.660288194044,'y':0.495457933719,'r':5}]
			},
			{label:['Тольятти: 7'],
			backgroundColor:'#447c69',
			data:[{'x':0.335331957017,'y':0.217257343561,'r':35}]
			},
			{label:['Томск: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.579525015983,'y':0.166644552728,'r':10}]
			},
			{label:['Топки: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.864750482434,'y':0.241763839661,'r':5}]
			},
			{label:['Тосно: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.929655094482,'y':0.932449878033,'r':5}]
			},
			{label:['Тула: 7'],
			backgroundColor:'#f19670',
			data:[{'x':0.0296937909994,'y':0.6,'r':35}]
			},
			{label:['Тюкалинск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.672797889608,'y':0.575062266541,'r':5}]
			},
			{label:['Тюмень: 14'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0426082383595,'y':0.448775012224,'r':70}]
			},
			{label:['Уварово: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.482642571596,'y':0.289761163036,'r':5}]
			},
			{label:['Улан-Удэ: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.282823719376,'y':0.178453135556,'r':10}]
			},
			{label:['Ульяновск: 4'],
			backgroundColor:'#be5168',
			data:[{'x':0.166487412153,'y':0.251410948649,'r':20}]
			},
			{label:['Уральск: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.525815392422,'y':0.428423023499,'r':10}]
			},
			{label:['Урюпинск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.9759445146,'y':0.885272300315,'r':5}]
			},
			{label:['Уссурийск: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.146604270714,'y':0.972803890099,'r':5}]
			},
			{label:['Уфа: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.189705340011,'y':0.33837800492,'r':15}]
			},
			{label:['Хабаровск: 3'],
			backgroundColor:'#c94a53',
			data:[{'x':0.55369015348,'y':0.728017978737,'r':15}]
			},
			{label:['Харьков: 6'],
			backgroundColor:'#9163b6',
			data:[{'x':0.462973732793,'y':0.139026273388,'r':30}]
			},
			{label:['Химки: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.823350654882,'y':0.242405174972,'r':5}]
			},
			{label:['Чайковский: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.00980434460227,'y':0.941315768601,'r':5}]
			},
			{label:['Чебоксары: 4'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.137914424735,'y':0.531735537814,'r':20}]
			},
			{label:['Челябинск: 21'],
			backgroundColor:'#9abf88',
			data:[{'x':0.112721959138,'y':0.803389770276,'r':105}]
			},
			{label:['Череповец: 3'],
			backgroundColor:'#51574a',
			data:[{'x':0.960363915518,'y':0.974551352269,'r':15}]
			},
			{label:['Чехов: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.485653759866,'y':0.536077938319,'r':5}]
			},
			{label:['Шатура: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.798738508943,'y':0.629196231242,'r':5}]
			},
			{label:['Шексна: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.0845222352565,'y':0.614486500631,'r':5}]
			},
			{label:['Шелехов: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.267106610997,'y':0.646666256271,'r':5}]
			},
			{label:['Шугозеро: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.812337845767,'y':0.287602809521,'r':5}]
			},
			{label:['Шумерля: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.35,'y':0.833316626501,'r':5}]
			},
			{label:['Щомыслица: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.940761278888,'y':0.00623430985022,'r':5}]
			},
			{label:['Щёлково: 3'],
			backgroundColor:'#be5168',
			data:[{'x':0.0348842356606,'y':0.255752732037,'r':15}]
			},
			{label:['Электросталь: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.9113411304,'y':0.394596817945,'r':10}]
			},
			{label:['Энгельс: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.814850693598,'y':0.640165811513,'r':5}]
			},
			{label:['Якутск: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.571027915691,'y':0.190262628629,'r':5}]
			},
			{label:['Ярославль: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.986038065866,'y':0.543835579093,'r':5}]
			},
			{label:['Bat Yam: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.428738443577,'y':0.608628397521,'r':5}]
			},
			{label:['Boston: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.118929015072,'y':0.160259573998,'r':5}]
			},
			{label:['Formentera de Segura: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.299846173911,'y':0.993055320754,'r':5}]
			},
			{label:['Gaborone: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.833650599057,'y':0.690007632093,'r':5}]
			},
			{label:['Helsinki: 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.858261955773,'y':0.681995540737,'r':10}]
			},
			{label:['London: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.175538742835,'y':0.872584905279,'r':5}]
			},
			{label:['Luanda: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.178149058326,'y':0.796022676604,'r':5}]
			},
			{label:['Manchester: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.185825957326,'y':0.79721151197,'r':5}]
			},
			{label:['New York City: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.299532610653,'y':0.275029743578,'r':5}]
			},
			{label:['Saarbrücken: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.647789821376,'y':0.0246303260763,'r':5}]
			},
			{label:['Wilhelmshaven: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.638517191889,'y':0.0248575058336,'r':5}]
			},
			{label:['Würzburg: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.991288323629,'y':0.885863674078,'r':5}]
			}																
		],
		options: {
			title: {
			  display: true,
			  text: 'Города группы VK Бег 2.0'
			},
			tooltips: {
				cornerRadius: 0,
				caretSize: 0,
				xPadding: 16,
				yPadding: 10,
				backgroundColor: 'rgba(0, 150, 100, 0.9)',
				titleFontStyle: 'normal',
				titleMarginBottom: 15
			  }			
		}		
	}
});