const CITIES = document.getElementById("cch");

Chart.defaults.global.animation.duration = 3000;
Chart.defaults.scale.ticks.beginAtZero = true;


let cities_chart = new Chart(CITIES, {
    type: 'bubble',
	data: {
		datasets: [
			{label:['Абакан: 4'],
			backgroundColor:'#4e2472',
			data:[{'x':0.866157264306,'y':0.626189264888,'r':20}]
			},
			{label:['Агинское: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.593422365382,'y':0.577123842182,'r':5}]
			},
			{label:['Адлер: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.913840579215,'y':0.0441972638096,'r':10}]
			},
			{label:['Азнакаево: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.869305070715,'y':0.939988733188,'r':5}]
			},
			{label:['Азов: 4'],
			backgroundColor:'#9abf88',
			data:[{'x':0.29813561878,'y':0.177711895443,'r':20}]
			},
			{label:['Акбулак: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.533719124925,'y':0.825097154139,'r':5}]
			},
			{label:['Актаныш: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.5570023771,'y':0.00843978105231,'r':10}]
			},
			{label:['Актау: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.34332519194,'y':0.824357298573,'r':5}]
			},
			{label:['Актобе: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.908768963092,'y':0.872179198677,'r':5}]
			},
			{label:['Александрия: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.332525745702,'y':0.183004274241,'r':5}]
			},
			{label:['Александров: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.100935780459,'y':0.898325887202,'r':5}]
			},
			{label:['Алексин: 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.719236597006,'y':0.399557197076,'r':10}]
			},
			{label:['Алеховщина: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.709434977511,'y':0.898669021554,'r':5}]
			},
			{label:['Алматы: 9'],
			backgroundColor:'#51574a',
			data:[{'x':0.695085980941,'y':0.135862678403,'r':45}]
			},
			{label:['Алушта: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.595773165211,'y':0.123641835237,'r':10}]
			},
			{label:['Алчевск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.994568423821,'y':0.921120651222,'r':5}]
			},
			{label:['Альметьевск: 4'],
			backgroundColor:'#993767',
			data:[{'x':0.848450651296,'y':0.753037979105,'r':20}]
			},
			{label:['Анапа: 4'],
			backgroundColor:'#c94a53',
			data:[{'x':0.134482300784,'y':0.645766612821,'r':20}]
			},
			{label:['Ангарск: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.780840454764,'y':0.1403099443,'r':10}]
			},
			{label:['Апатиты: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.553715702499,'y':0.440364309316,'r':10}]
			},
			{label:['Арзамас: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.706268417317,'y':0.9688335868,'r':10}]
			},
			{label:['Армавир: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.401395092437,'y':0.441546434782,'r':5}]
			},
			{label:['Архангельск: 11'],
			backgroundColor:'#447c69',
			data:[{'x':0.646003666322,'y':0.871218607227,'r':55}]
			},
			{label:['Астана: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.403046846602,'y':0.964666836639,'r':15}]
			},
			{label:['Астрахань: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.6233489814,'y':0.813850160152,'r':10}]
			},
			{label:['Атяшево: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.305299482649,'y':0.711984862341,'r':5}]
			},
			{label:['Ахтубинск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.891146194883,'y':0.069519721534,'r':5}]
			},
			{label:['Бабаево: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.358914152644,'y':0.152417240439,'r':5}]
			},
			{label:['Балаково: 3'],
			backgroundColor:'#f19670',
			data:[{'x':0.903454334132,'y':0.811231925173,'r':15}]
			},
			{label:['Балахна: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.879710088782,'y':0.754740987012,'r':5}]
			},
			{label:['Балашиха: 5'],
			backgroundColor:'#51574a',
			data:[{'x':0.197988479648,'y':0.625991062392,'r':25}]
			},
			{label:['Балтийск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.252982268884,'y':0.681494946934,'r':5}]
			},
			{label:['Барановичи: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.338289855016,'y':0.988049975523,'r':10}]
			},
			{label:['Барнаул: 6'],
			backgroundColor:'#447c69',
			data:[{'x':0.724585751392,'y':0.482496654645,'r':30}]
			},
			{label:['Басим: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.285203398343,'y':0.470678210097,'r':5}]
			},
			{label:['Белгород: 17'],
			backgroundColor:'#4e2472',
			data:[{'x':0.972499140885,'y':0.407342010657,'r':85}]
			},
			{label:['Белово: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.910128918035,'y':0.470725860521,'r':5}]
			},
			{label:['Белорецк: 3'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.326674453204,'y':0.0679832428212,'r':15}]
			},
			{label:['Белореченск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.618232970964,'y':0.583874842748,'r':5}]
			},
			{label:['Бердск: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.391545449763,'y':0.744219745367,'r':5}]
			},
			{label:['Березники: 6'],
			backgroundColor:'#51574a',
			data:[{'x':0.619405474187,'y':0.694084740728,'r':30}]
			},
			{label:['Березно: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.196347789009,'y':0.219792208305,'r':5}]
			},
			{label:['Березовский: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.506298771139,'y':0.158450214559,'r':5}]
			},
			{label:['Бийск: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.149142374586,'y':0.669588803781,'r':5}]
			},
			{label:['Бикин: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.37502986142,'y':0.568806985944,'r':5}]
			},
			{label:['Бишкек: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.563071150837,'y':0.62737691711,'r':10}]
			},
			{label:['Бобруйск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.235928868716,'y':0.961078754589,'r':5}]
			},
			{label:['Большие Колпаны: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.701487382319,'y':0.0524246062071,'r':5}]
			},
			{label:['Бор: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.260559326883,'y':0.908614925333,'r':5}]
			},
			{label:['Борисоглебск: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.01996925935,'y':0.0106943428121,'r':10}]
			},
			{label:['Борисполь: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.372667355458,'y':0.950004576617,'r':5}]
			},
			{label:['Братск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.585375329271,'y':0.529406729626,'r':5}]
			},
			{label:['Брест: 11'],
			backgroundColor:'#5698c4',
			data:[{'x':0.389781448625,'y':0.56594037867,'r':55}]
			},
			{label:['Брехово: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.525487556725,'y':0.215720189619,'r':5}]
			},
			{label:['Брянка: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0992330030113,'y':0.308608004784,'r':5}]
			},
			{label:['Брянск: 9'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.787257133804,'y':0.315349368731,'r':45}]
			},
			{label:['Буздяк: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.293749425119,'y':0.17996552032,'r':10}]
			},
			{label:['Буинск: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.196722281137,'y':0.455378488957,'r':5}]
			},
			{label:['Великий Новгород: 5'],
			backgroundColor:'#f19670',
			data:[{'x':0.459152587524,'y':0.262454760046,'r':25}]
			},
			{label:['Вельск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.865386548167,'y':0.212111799544,'r':5}]
			},
			{label:['Верхнедвинск: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.166870029877,'y':0.402163179218,'r':5}]
			},
			{label:['Верхнеднепровский: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0662195838344,'y':0.937853198001,'r':5}]
			},
			{label:['Верхний Баскунчак: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.206595317491,'y':0.257931245983,'r':5}]
			},
			{label:['Верхний Тагил: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.225597465303,'y':0.834582392188,'r':5}]
			},
			{label:['Верхняя Пышма: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.345425584432,'y':0.63497880548,'r':10}]
			},
			{label:['Верхняя Салда: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0125755840263,'y':0.0101919354737,'r':10}]
			},
			{label:['Верхоянск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.549126748299,'y':0.484804928743,'r':5}]
			},
			{label:['Веселый Гай: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.0605272689273,'y':0.344419556608,'r':5}]
			},
			{label:['Ветлуга: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.919533494636,'y':0.57728549614,'r':5}]
			},
			{label:['Вилейка: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.210106104268,'y':0.899487638727,'r':5}]
			},
			{label:['Винница: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.869572673505,'y':0.438038240693,'r':10}]
			},
			{label:['Витебск: 5'],
			backgroundColor:'#74c493',
			data:[{'x':0.68655710753,'y':0.126345516839,'r':25}]
			},
			{label:['Владивосток: 13'],
			backgroundColor:'#c94a53',
			data:[{'x':0.272422921986,'y':0.0481666351279,'r':65}]
			},
			{label:['Владикавказ: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.160776557803,'y':0.0688496290959,'r':5}]
			},
			{label:['Владимир: 12'],
			backgroundColor:'#e279a3',
			data:[{'x':0.328415342709,'y':0.123732951281,'r':60}]
			},
			{label:['Волгоград: 16'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.848112663262,'y':0.802200520121,'r':80}]
			},
			{label:['Волгодонск: 5'],
			backgroundColor:'#5698c4',
			data:[{'x':0.941309120769,'y':0.239769370258,'r':25}]
			},
			{label:['Волжск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.5812534412,'y':0.762829512599,'r':5}]
			},
			{label:['Волжский: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.0154517213922,'y':0.341929419979,'r':10}]
			},
			{label:['Воловец: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.271028239056,'y':0.878559407079,'r':5}]
			},
			{label:['Вологда: 7'],
			backgroundColor:'#e16552',
			data:[{'x':0.419653153595,'y':0.148658129345,'r':35}]
			},
			{label:['Волосово: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.577326524153,'y':0.16849170754,'r':5}]
			},
			{label:['Вольногорск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.669903254742,'y':0.188376785946,'r':5}]
			},
			{label:['Вольск: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.479047209887,'y':0.992147490272,'r':10}]
			},
			{label:['Воркута: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.190800946813,'y':0.484747261429,'r':5}]
			},
			{label:['Воронеж: 14'],
			backgroundColor:'#447c69',
			data:[{'x':0.263567869175,'y':0.0800882402786,'r':70}]
			},
			{label:['Воткинск: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.00666411734907,'y':0.0121748324901,'r':10}]
			},
			{label:['Выборг: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.219311138414,'y':0.300273160759,'r':20}]
			},
			{label:['Вычегодский: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.59924577572,'y':0.85710076127,'r':5}]
			},
			{label:['Вышний Волочек: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.169933301421,'y':0.702797984777,'r':10}]
			},
			{label:['Вяземский: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.823965169515,'y':0.0647080938245,'r':5}]
			},
			{label:['Вязьма: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.500354900242,'y':0.844625027203,'r':5}]
			},
			{label:['Вятские Поляны: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.813275507528,'y':0.994061727486,'r':5}]
			},
			{label:['Гагарин: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.341129897666,'y':0.935913886848,'r':5}]
			},
			{label:['Ганцевичи: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.859023499363,'y':0.30990943236,'r':5}]
			},
			{label:['Гатчина: 2'],
			backgroundColor:'#a34974',
			data:[{'x':0.45053288518,'y':0.782520341024,'r':10}]
			},
			{label:['Геленджик: 4'],
			backgroundColor:'#51574a',
			data:[{'x':0.860592979977,'y':0.698503308637,'r':20}]
			},
			{label:['Георгиевск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.00985527995797,'y':0.783180417785,'r':5}]
			},
			{label:['Гжель: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.361601865636,'y':0.811463143979,'r':5}]
			},
			{label:['Гомель: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.75945130614,'y':0.686723816508,'r':15}]
			},
			{label:['Горно-Алтайск: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.323239030084,'y':0.218730207942,'r':10}]
			},
			{label:['Горноуральский: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.249176788242,'y':0.572432414576,'r':5}]
			},
			{label:['Грахово: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.464587728427,'y':0.971273090184,'r':5}]
			},
			{label:['Гродно: 4'],
			backgroundColor:'#993767',
			data:[{'x':0.366495764419,'y':0.954302389763,'r':20}]
			},
			{label:['Грозный: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.594964646135,'y':0.551330467577,'r':5}]
			},
			{label:['Грязовец: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.255789925022,'y':0.711987688556,'r':5}]
			},
			{label:['Губкинский: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.611117767948,'y':0.868030009051,'r':5}]
			},
			{label:['Гуково: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.626820291783,'y':0.676486937365,'r':10}]
			},
			{label:['Гурьевск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.987963383647,'y':0.755259698284,'r':5}]
			},
			{label:['Гусь-Хрустальный: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.340069433942,'y':0.131079244351,'r':5}]
			},
			{label:['Данилов: 3'],
			backgroundColor:'#74c493',
			data:[{'x':0.0827597598626,'y':0.244547244222,'r':15}]
			},
			{label:['Дебальцево: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.222309720325,'y':0.868475712122,'r':5}]
			},
			{label:['Дегтярск: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.758229502057,'y':0.236053703116,'r':5}]
			},
			{label:['Десногорск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0248210614244,'y':0.569887759822,'r':5}]
			},
			{label:['Дзержинск: 6'],
			backgroundColor:'#e279a3',
			data:[{'x':0.354445155157,'y':0.770500749072,'r':30}]
			},
			{label:['Димитровград: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.508060003731,'y':0.505494175925,'r':5}]
			},
			{label:['Дмитров: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.895330073366,'y':0.902017600749,'r':10}]
			},
			{label:['Днепропетровск (Днепр): 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.388288194915,'y':0.567245239674,'r':10}]
			},
			{label:['Добрянка: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.595040667812,'y':0.605421160895,'r':5}]
			},
			{label:['Домодедово: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.88260614898,'y':0.546499319787,'r':15}]
			},
			{label:['Донецк: 9'],
			backgroundColor:'#74c493',
			data:[{'x':0.39976222857,'y':0.386748540687,'r':45}]
			},
			{label:['Дружковка: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.509945075626,'y':0.794962543212,'r':5}]
			},
			{label:['Дружный: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.714202985772,'y':0.147681403614,'r':5}]
			},
			{label:['Дубна: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.236182439044,'y':0.786534749138,'r':10}]
			},
			{label:['Дятьково: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.415665069505,'y':0.68994547631,'r':5}]
			},
			{label:['Ейск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.485070834687,'y':0.549197032123,'r':5}]
			},
			{label:['Екатеринбург: 46'],
			backgroundColor:'#c94a53',
			data:[{'x':0.886760980339,'y':0.115952097476,'r':230}]
			},
			{label:['Елабуга: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.252253367876,'y':0.564396402369,'r':10}]
			},
			{label:['Елань: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.148875964242,'y':0.470887652394,'r':5}]
			},
			{label:['Елец: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.165654725501,'y':0.777868152083,'r':10}]
			},
			{label:['Ельня: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.304084225441,'y':0.323794142188,'r':5}]
			},
			{label:['Железнодорожный (Балашиха): 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.278889601265,'y':0.244374841985,'r':10}]
			},
			{label:['Жигулевск: 3'],
			backgroundColor:'#65387d',
			data:[{'x':0.23699035621,'y':0.255616959816,'r':15}]
			},
			{label:['Житомир: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.417951114626,'y':0.870801185118,'r':5}]
			},
			{label:['Жлобин: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.120909815599,'y':0.557805032054,'r':5}]
			},
			{label:['Жуковский: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.00843277629741,'y':0.368425776703,'r':5}]
			},
			{label:['Задонск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.754303214159,'y':0.499328280475,'r':5}]
			},
			{label:['Зайсан: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.406143909934,'y':0.490825787585,'r':5}]
			},
			{label:['Заокский: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.866575748723,'y':0.129892062027,'r':5}]
			},
			{label:['Запорожье: 7'],
			backgroundColor:'#447c69',
			data:[{'x':0.77589640041,'y':0.461830820608,'r':35}]
			},
			{label:['Заречное: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.773890101094,'y':0.334104023656,'r':5}]
			},
			{label:['Звенигород: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.49187809935,'y':0.515507713199,'r':5}]
			},
			{label:['Зеленоград: 4'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.472854240328,'y':0.991320519344,'r':20}]
			},
			{label:['Зима: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.822298104388,'y':0.521943283206,'r':10}]
			},
			{label:['Златоуст: 3'],
			backgroundColor:'#51574a',
			data:[{'x':0.154083190794,'y':0.261797361738,'r':15}]
			},
			{label:['Змиев: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.207007859974,'y':0.908289437836,'r':5}]
			},
			{label:['Знаменск: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.0578027258454,'y':0.104786012048,'r':10}]
			},
			{label:['Ибреси: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.292330446908,'y':0.0895505586803,'r':5}]
			},
			{label:['Иваново: 7'],
			backgroundColor:'#e2975d',
			data:[{'x':0.571491648058,'y':0.244436361171,'r':35}]
			},
			{label:['Ивантеевка: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.064781445471,'y':0.422132011679,'r':5}]
			},
			{label:['Иерусалим: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.642771324449,'y':0.130350735482,'r':5}]
			},
			{label:['Ижевск: 16'],
			backgroundColor:'#f19670',
			data:[{'x':0.162555960948,'y':0.829125110145,'r':80}]
			},
			{label:['Ирбит: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.0734976421615,'y':0.08959029064,'r':5}]
			},
			{label:['Иркутск: 7'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.812651890437,'y':0.956724229541,'r':35}]
			},
			{label:['Ишим: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.589942172354,'y':0.874114552613,'r':5}]
			},
			{label:['Ишимбай: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.493217767941,'y':0.509538845941,'r':5}]
			},
			{label:['Йошкар-Ола: 9'],
			backgroundColor:'#4e2472',
			data:[{'x':0.760033736445,'y':0.7649349488,'r':45}]
			},
			{label:['Кагул: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.230652724704,'y':0.4480782791,'r':5}]
			},
			{label:['Кадуй: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.853300167757,'y':0.344618098159,'r':5}]
			},
			{label:['Казань: 21'],
			backgroundColor:'#e279a3',
			data:[{'x':0.282630363233,'y':0.180566622532,'r':105}]
			},
			{label:['Калининград: 20'],
			backgroundColor:'#a34974',
			data:[{'x':0.0710691841446,'y':0.449490400596,'r':100}]
			},
			{label:['Калуга: 10'],
			backgroundColor:'#65387d',
			data:[{'x':0.772393844888,'y':0.245484898971,'r':50}]
			},
			{label:['Каменское / Днепродзержинск: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.959141094951,'y':0.413209462034,'r':10}]
			},
			{label:['Камень-Каширский: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.506442162447,'y':0.18593421184,'r':5}]
			},
			{label:['Камышин: 3'],
			backgroundColor:'#e16552',
			data:[{'x':0.0620255048523,'y':0.867057038108,'r':15}]
			},
			{label:['Карабаново: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.591441747523,'y':0.985656857381,'r':5}]
			},
			{label:['Карагай: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.672675648133,'y':0.469104478778,'r':5}]
			},
			{label:['Караганда: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.490466337653,'y':0.361617687223,'r':10}]
			},
			{label:['Карачев: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.470571177804,'y':0.531433295439,'r':5}]
			},
			{label:['Карпинск: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.973145399217,'y':0.216504418571,'r':10}]
			},
			{label:['Каспийск: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.452884487812,'y':0.143388491245,'r':5}]
			},
			{label:['Катав-Ивановск: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.831396698313,'y':0.260565670112,'r':5}]
			},
			{label:['Качканар: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.0730248318341,'y':0.28785326722,'r':5}]
			},
			{label:['Кашира: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.548527323546,'y':0.73284372694,'r':5}]
			},
			{label:['Кемерово: 10'],
			backgroundColor:'#e0598b',
			data:[{'x':0.628197878295,'y':0.199384647551,'r':50}]
			},
			{label:['Керчь: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.18586623794,'y':0.4918124236,'r':5}]
			},
			{label:['Киев: 13'],
			backgroundColor:'#a34974',
			data:[{'x':0.948479605481,'y':0.465727957438,'r':65}]
			},
			{label:['Кимры: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.64873676793,'y':0.783773875023,'r':5}]
			},
			{label:['Кинешма: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.558325633556,'y':0.565989566866,'r':10}]
			},
			{label:['Киржач: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.0488793794786,'y':0.957843631746,'r':5}]
			},
			{label:['Кириши: 3'],
			backgroundColor:'#be5168',
			data:[{'x':0.75277175984,'y':0.7430089991,'r':15}]
			},
			{label:['Киров: 11'],
			backgroundColor:'#5698c4',
			data:[{'x':0.450383026329,'y':0.235162052942,'r':55}]
			},
			{label:['Кирово-Чепецк: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.014834211667,'y':0.507829848041,'r':5}]
			},
			{label:['Кислово: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.200036434926,'y':0.584303841855,'r':5}]
			},
			{label:['Кисловодск: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.394760111422,'y':0.878593116938,'r':20}]
			},
			{label:['Клин: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.242163189799,'y':0.114229191652,'r':10}]
			},
			{label:['Ковдор: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.00660904258152,'y':0.404258625464,'r':5}]
			},
			{label:['Ковель: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.396508999013,'y':0.31882561759,'r':5}]
			},
			{label:['Ковров: 4'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.982446264606,'y':0.559610973471,'r':20}]
			},
			{label:['Ковылкино: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.00375721190998,'y':0.89548804636,'r':5}]
			},
			{label:['Козельск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.0984049683949,'y':0.490886789164,'r':5}]
			},
			{label:['Коломна: 6'],
			backgroundColor:'#a34974',
			data:[{'x':0.666766188655,'y':0.860205482878,'r':30}]
			},
			{label:['Колпино: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.991212758982,'y':0.109890015843,'r':10}]
			},
			{label:['Комрат: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.588174811619,'y':0.864265275758,'r':5}]
			},
			{label:['Комсомольск-на-Амуре: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.669457292735,'y':0.347685114067,'r':10}]
			},
			{label:['Конаково: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.350921050218,'y':0.501793886527,'r':5}]
			},
			{label:['Кондопога: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.535024099145,'y':0.05846193188,'r':5}]
			},
			{label:['Коновалово: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.33814617824,'y':0.389889002495,'r':5}]
			},
			{label:['Конотоп: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.701435412349,'y':0.379606639544,'r':5}]
			},
			{label:['Копейск: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.129824032796,'y':0.422533698504,'r':5}]
			},
			{label:['Королёв: 4'],
			backgroundColor:'#74c493',
			data:[{'x':0.739315556357,'y':0.252499302625,'r':20}]
			},
			{label:['Корсаков: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.492370937229,'y':0.850975747327,'r':5}]
			},
			{label:['Корткерос: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.630124525274,'y':0.189929080657,'r':5}]
			},
			{label:['Костанай: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.890624919316,'y':0.257872936177,'r':15}]
			},
			{label:['Костомукша: 13'],
			backgroundColor:'#65387d',
			data:[{'x':0.626860496717,'y':0.473233956529,'r':65}]
			},
			{label:['Кострома: 5'],
			backgroundColor:'#447c69',
			data:[{'x':0.636770715702,'y':0.964040629176,'r':25}]
			},
			{label:['Красноармейск: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.636289763274,'y':0.568027941878,'r':5}]
			},
			{label:['Красногорск: 3'],
			backgroundColor:'#4e2472',
			data:[{'x':0.22283249839,'y':0.961805557068,'r':15}]
			},
			{label:['Красноград: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.874835878808,'y':0.384865667388,'r':5}]
			},
			{label:['Краснодар: 34'],
			backgroundColor:'#e279a3',
			data:[{'x':0.871713051853,'y':0.0444535614004,'r':170}]
			},
			{label:['Краснодон: 4'],
			backgroundColor:'#be5168',
			data:[{'x':0.992940123295,'y':0.864154842784,'r':20}]
			},
			{label:['Краснознаменск: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.927325743991,'y':0.783533962371,'r':15}]
			},
			{label:['Красноярск: 9'],
			backgroundColor:'#993767',
			data:[{'x':0.516612184475,'y':0.469474425586,'r':45}]
			},
			{label:['Красный Стекловар: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.479074037104,'y':0.449546078871,'r':5}]
			},
			{label:['Кременец: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.51984918706,'y':0.444907212582,'r':5}]
			},
			{label:['Кременчуг: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.929715842771,'y':0.687041920922,'r':5}]
			},
			{label:['Крестцы: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.403200648636,'y':0.361847453269,'r':5}]
			},
			{label:['Кривой Рог: 3'],
			backgroundColor:'#e16552',
			data:[{'x':0.558202741877,'y':0.450033597731,'r':15}]
			},
			{label:['Кропачёво: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.711946460742,'y':0.75788074645,'r':5}]
			},
			{label:['Кропивницкий / Кировоград: 3'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.814165593008,'y':0.0928569523864,'r':15}]
			},
			{label:['Кстово: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.94912294299,'y':0.650457604125,'r':10}]
			},
			{label:['Кузнецк: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.383241391966,'y':0.784108610176,'r':5}]
			},
			{label:['Кулебаки: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.841951447166,'y':0.982745937895,'r':5}]
			},
			{label:['Кумертау: 5'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.499031016507,'y':0.785744756515,'r':25}]
			},
			{label:['Кунгур: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.668721189276,'y':0.285424217675,'r':5}]
			},
			{label:['Курган: 4'],
			backgroundColor:'#5698c4',
			data:[{'x':0.669001519106,'y':0.864963830959,'r':15}]
			},
			{label:['Куровское: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.798991046042,'y':0.225465734743,'r':5}]
			},
			{label:['Курск: 9'],
			backgroundColor:'#be5168',
			data:[{'x':0.406752254187,'y':0.46136146976,'r':45}]
			},
			{label:['Курчатов: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.773362541717,'y':0.703811249886,'r':10}]
			},
			{label:['Кызылорда : 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.447380216844,'y':0.801577066973,'r':5}]
			},
			{label:['Кыштым: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.368771802807,'y':0.668296797843,'r':5}]
			},
			{label:['Кяхта: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.799149848281,'y':0.975524792097,'r':5}]
			},
			{label:['Лангепас: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.157523934835,'y':0.858850986406,'r':5}]
			},
			{label:['Лахденпохья: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.58986870371,'y':0.701516211012,'r':5}]
			},
			{label:['Лениногорск: 4'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.544764414166,'y':0.879210983428,'r':20}]
			},
			{label:['Ленинск-Кузнецкий: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.273734374065,'y':0.794838192582,'r':5}]
			},
			{label:['Лесной: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.256645345291,'y':0.568496388746,'r':10}]
			},
			{label:['Лесосибирск: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.541516164597,'y':0.368813915348,'r':10}]
			},
			{label:['Ливны: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.803830388351,'y':0.0556041885394,'r':10}]
			},
			{label:['Ликино-Дулево: 3'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.260269356511,'y':0.691702091132,'r':15}]
			},
			{label:['Липецк: 11'],
			backgroundColor:'#4e2472',
			data:[{'x':0.367694915312,'y':0.233771448778,'r':55}]
			},
			{label:['Лобня: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.419383747491,'y':0.802531604434,'r':10}]
			},
			{label:['Лосино-Петровский: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.16581132858,'y':0.192109202927,'r':5}]
			},
			{label:['Луганск: 4'],
			backgroundColor:'#9abf88',
			data:[{'x':0.892923797935,'y':0.505821800662,'r':20}]
			},
			{label:['Луховицы: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.839546792458,'y':0.345315256281,'r':5}]
			},
			{label:['Львов: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.298998089293,'y':0.24957264258,'r':20}]
			},
			{label:['Люберцы: 4'],
			backgroundColor:'#a34974',
			data:[{'x':0.19394981457,'y':0.799697719875,'r':20}]
			},
			{label:['Люботин: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.208741728,'y':0.255753831715,'r':5}]
			},
			{label:['Людиново: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.241320995076,'y':0.609170682456,'r':10}]
			},
			{label:['Магадан: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.911797575412,'y':0.666430897857,'r':5}]
			},
			{label:['Магнитогорск: 4'],
			backgroundColor:'#e0598b',
			data:[{'x':0.38423489194,'y':0.446889514269,'r':20}]
			},
			{label:['Майкоп: 3'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.304328724336,'y':0.84064612041,'r':15}]
			},
			{label:['Малин: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.0119933730364,'y':0.959268145108,'r':5}]
			},
			{label:['Манжерок: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.755909843399,'y':0.0934638590202,'r':5}]
			},
			{label:['Мариинский Посад: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.33188804864,'y':0.788829501281,'r':5}]
			},
			{label:['Мариуполь: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.864107343098,'y':0.796581273375,'r':10}]
			},
			{label:['Махачкала: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.642933199856,'y':0.986632809268,'r':10}]
			},
			{label:['Медвежий Угол: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.44086212183,'y':0.0348171781137,'r':5}]
			},
			{label:['Медвежьегорск: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.682392740705,'y':0.733478781918,'r':5}]
			},
			{label:['Мелеуз: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.920072196652,'y':0.361903082106,'r':5}]
			},
			{label:['Миасс: 4'],
			backgroundColor:'#74c493',
			data:[{'x':0.92310715955,'y':0.874769777666,'r':20}]
			},
			{label:['Микунь: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0607353403784,'y':0.816780603111,'r':10}]
			},
			{label:['Минеральные Воды: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.282000809704,'y':0.470480444034,'r':5}]
			},
			{label:['Минск: 27'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.887501721128,'y':0.247389389225,'r':135}]
			},
			{label:['Минусинск: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.937800327546,'y':0.705422977784,'r':10}]
			},
			{label:['Мирный: 5'],
			backgroundColor:'#993767',
			data:[{'x':0.0898852743619,'y':0.487198248006,'r':25}]
			},
			{label:['Мичуринск: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.359116199215,'y':0.258205996936,'r':10}]
			},
			{label:['Могилёв: 5'],
			backgroundColor:'#74c493',
			data:[{'x':0.580180108062,'y':0.944076494675,'r':25}]
			},
			{label:['Молодечно: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.879820019628,'y':0.291307255977,'r':5}]
			},
			{label:['Монино: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.379271077599,'y':0.540745019504,'r':10}]
			},
			{label:['Мончегорск: 3'],
			backgroundColor:'#e279a3',
			data:[{'x':0.134423683907,'y':0.596764961619,'r':15}]
			},
			{label:['Морозовск: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.397212012014,'y':0.707716540021,'r':5}]
			},
			{label:['Москва: 396'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.446356173129,'y':0.610431340931,'r':300}]
			},
			{label:['Мурманск: 22'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.949416978011,'y':0.87,'r':110}]
			},
			{label:['Муром: 3'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.977734061533,'y':0.940575930677,'r':15}]
			},
			{label:['Мценск: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.171520051028,'y':0.658527214936,'r':5}]
			},
			{label:['Мытищи: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.296799984254,'y':0.485322477467,'r':10}]
			},
			{label:['Мышкин: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0576490348133,'y':0.0629247705328,'r':20}]
			},
			{label:['Набережные Челны: 14'],
			backgroundColor:'#447c69',
			data:[{'x':0.0182152281762,'y':0.45778222738,'r':70}]
			},
			{label:['Навашино: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.241197617028,'y':0.641364551625,'r':5}]
			},
			{label:['Налобиха: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.568905774559,'y':0.501293998379,'r':5}]
			},
			{label:['Нальчик: 3'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0828681239623,'y':0.0195846119485,'r':15}]
			},
			{label:['Намцы: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.230127968147,'y':0.0476409218472,'r':5}]
			},
			{label:['Наро-Фоминск: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.83913398576,'y':0.488827623215,'r':10}]
			},
			{label:['Нарьян-Мар: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.203533773413,'y':0.649767310853,'r':5}]
			},
			{label:['Наследницкий: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.631837082888,'y':0.537860126217,'r':5}]
			},
			{label:['Невель: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.431363618856,'y':0.572496126107,'r':5}]
			},
			{label:['Невинномысск: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.176260560102,'y':0.373954798433,'r':10}]
			},
			{label:['Невьянск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.234002920329,'y':0.135107276406,'r':5}]
			},
			{label:['Нерюнгри: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.251157211921,'y':0.440457961824,'r':5}]
			},
			{label:['Несолонь: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.690111535541,'y':0.516023775395,'r':5}]
			},
			{label:['Нефтекамск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.472222274385,'y':0.898575448205,'r':5}]
			},
			{label:['Нефтеюганск: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.544321324472,'y':0.534335928784,'r':10}]
			},
			{label:['Нижневартовск: 5'],
			backgroundColor:'#65387d',
			data:[{'x':0.407880372115,'y':0.123324198054,'r':25}]
			},
			{label:['Нижнекамск: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.89296075359,'y':0.0852675579397,'r':10}]
			},
			{label:['Нижний Новгород: 39'],
			backgroundColor:'#5698c4',
			data:[{'x':0.418432577386,'y':0.396552805735,'r':195}]
			},
			{label:['Нижний Тагил: 8'],
			backgroundColor:'#9163b6',
			data:[{'x':0.416679098605,'y':0.553206066858,'r':40}]
			},
			{label:['Николаев: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.610791864333,'y':0.196323823387,'r':5}]
			},
			{label:['Никольск: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.243960350411,'y':0.148329653869,'r':5}]
			},
			{label:['Нововоронеж: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.326049744629,'y':0.862025872657,'r':10}]
			},
			{label:['Новое Юшкозеро: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.992122962699,'y':0.573088835229,'r':5}]
			},
			{label:['Новокузнецк: 3'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0969267532521,'y':0.874312849521,'r':15}]
			},
			{label:['Новомичуринск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.257249432971,'y':0.791858304398,'r':5}]
			},
			{label:['Новомосковск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.980700197144,'y':0.200528313463,'r':5}]
			},
			{label:['Новополоцк: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.549862261619,'y':0.536325584178,'r':5}]
			},
			{label:['Новосибирск: 36'],
			backgroundColor:'#a34974',
			data:[{'x':0.408958396594,'y':0.417665979653,'r':180}]
			},
			{label:['Новоугольный: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.736671324715,'y':0.385699384226,'r':5}]
			},
			{label:['Новоуральск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.386022029418,'y':0.0341842426661,'r':5}]
			},
			{label:['Новочебоксарск: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.992329967678,'y':0.67216808218,'r':15}]
			},
			{label:['Новочеркасск: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.380440476383,'y':0.865921253888,'r':5}]
			},
			{label:['Новошахтинск: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.39230541145,'y':0.837441905728,'r':5}]
			},
			{label:['Новый Уренгой: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.438504242744,'y':0.0413238322976,'r':10}]
			},
			{label:['Ноябрьск: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.0630224826197,'y':0.919394291844,'r':10}]
			},
			{label:['Нытва: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.794480376688,'y':0.268030308822,'r':5}]
			},
			{label:['Нягань: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.734741513573,'y':0.449111745389,'r':5}]
			},
			{label:['Няндома: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.400899650642,'y':0.285432524757,'r':10}]
			},
			{label:['Обнинск: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.0328571097011,'y':0.788131718483,'r':5}]
			},
			{label:['Одесса: 7'],
			backgroundColor:'#993767',
			data:[{'x':0.415853628481,'y':0.233295721235,'r':35}]
			},
			{label:['Одинцово: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.08071164001,'y':0.533743424243,'r':5}]
			},
			{label:['Озерск: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.101151201725,'y':0.297266807818,'r':10}]
			},
			{label:['Озёры: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.0288053241257,'y':0.640740901711,'r':5}]
			},
			{label:['Октябрьский: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.227678999454,'y':0.968938132865,'r':5}]
			},
			{label:['Оленегорск: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.903116547725,'y':0.582933740064,'r':10}]
			},
			{label:['Омск: 13'],
			backgroundColor:'#993767',
			data:[{'x':0.00648878120825,'y':0.549883997609,'r':65}]
			},
			{label:['Оренбург: 5'],
			backgroundColor:'#f19670',
			data:[{'x':0.0360411135839,'y':0.670877389924,'r':25}]
			},
			{label:['Орехово-Зуево: 3'],
			backgroundColor:'#a34974',
			data:[{'x':0.0560793791056,'y':0.553172205927,'r':15}]
			},
			{label:['Орск: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.859505931404,'y':0.407217353595,'r':10}]
			},
			{label:['Орша: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.287642924747,'y':0.543250418579,'r':5}]
			},
			{label:['Орёл: 8'],
			backgroundColor:'#e2975d',
			data:[{'x':0.825360719376,'y':0.26597836373,'r':40}]
			},
			{label:['Оса: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.293890787581,'y':0.0369421609849,'r':5}]
			},
			{label:['Осиповичи: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.563527719583,'y':0.0661782165721,'r':5}]
			},
			{label:['Острог: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.63673914721,'y':0.0846930713698,'r':5}]
			},
			{label:['Оха: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.405833289555,'y':0.131806050708,'r':5}]
			},
			{label:['Оханск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.723851875098,'y':0.656185788513,'r':5}]
			},
			{label:['Павлово: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.207398647929,'y':0.472321517863,'r':5}]
			},
			{label:['Павловская: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.825378532867,'y':0.637194510013,'r':5}]
			},
			{label:['Павловский Посад: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.638326417427,'y':0.76141667774,'r':5}]
			},
			{label:['Павлодар: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.623666517404,'y':0.747186104082,'r':10}]
			},
			{label:['Пенза: 9'],
			backgroundColor:'#65387d',
			data:[{'x':0.500491966789,'y':0.569012811372,'r':45}]
			},
			{label:['Первоуральск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.444419198445,'y':0.878891775973,'r':5}]
			},
			{label:['Переславль-Залесский: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.0793244396868,'y':0.908311121552,'r':5}]
			},
			{label:['Пермь: 40'],
			backgroundColor:'#c94a53',
			data:[{'x':0.451686673175,'y':0.536252939744,'r':200}]
			},
			{label:['Петрозаводск: 10'],
			backgroundColor:'#e2975d',
			data:[{'x':0.477093434665,'y':0.441369167292,'r':50}]
			},
			{label:['Петропавловск: 4'],
			backgroundColor:'#f19670',
			data:[{'x':0.239159499963,'y':0.240437960353,'r':20}]
			},
			{label:['Петропавловск-Камчатский: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.256793674587,'y':0.030387250084,'r':10}]
			},
			{label:['Пиль-Егор: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.154575436248,'y':0.663817900422,'r':5}]
			},
			{label:['Пинск: 3'],
			backgroundColor:'#c94a53',
			data:[{'x':0.643411204112,'y':0.862698737095,'r':15}]
			},
			{label:['Пионерский: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.569149688113,'y':0.475529763267,'r':5}]
			},
			{label:['Питер: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.268693559415,'y':0.321350904231,'r':5}]
			},
			{label:['Платнировская: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.32048075567,'y':0.136540735507,'r':5}]
			},
			{label:['Плеханово: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.490832132195,'y':0.38293142718,'r':5}]
			},
			{label:['Подольск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.119157256418,'y':0.884271687957,'r':5}]
			},
			{label:['Подстепки: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.125364127569,'y':0.00873368613216,'r':5}]
			},
			{label:['Пойковский: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.419015009201,'y':0.81241885054,'r':5}]
			},
			{label:['Полевской: 3'],
			backgroundColor:'#51574a',
			data:[{'x':0.171270856644,'y':0.155281062626,'r':15}]
			},
			{label:['Полоцк: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.950581106306,'y':0.742337121501,'r':5}]
			},
			{label:['Полтава: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.336252139605,'y':0.560280277921,'r':5}]
			},
			{label:['Полярный: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.893056106565,'y':0.776510629552,'r':5}]
			},
			{label:['Похвистнево: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.762999075648,'y':0.568912586678,'r':5}]
			},
			{label:['Почапки: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.324914733001,'y':0.842151172865,'r':5}]
			},
			{label:['Прилуки: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.138042038292,'y':0.243209638878,'r':5}]
			},
			{label:['Протвино: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.0750918862217,'y':0.160635064094,'r':5}]
			},
			{label:['Псков: 8'],
			backgroundColor:'#447c69',
			data:[{'x':0.540384704924,'y':0.112767026279,'r':40}]
			},
			{label:['Пугачев: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.723383114567,'y':0.612934928292,'r':5}]
			},
			{label:['Пудож: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.44865386461,'y':0.157470862033,'r':5}]
			},
			{label:['Пучеж: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.32325728827,'y':0.471336872683,'r':5}]
			},
			{label:['Пушкин: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.841513786183,'y':0.083649207074,'r':10}]
			},
			{label:['Пушкино: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.338640498637,'y':0.432680779459,'r':5}]
			},
			{label:['Радужный: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.531504676661,'y':0.0684535965267,'r':5}]
			},
			{label:['Раменское: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.343428188522,'y':0.151866790183,'r':5}]
			},
			{label:['Ревда: 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.815918689556,'y':0.09692203248,'r':10}]
			},
			{label:['Ришон ЛеЦион: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.237804844084,'y':0.114177277075,'r':5}]
			},
			{label:['Ровно: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.76290383244,'y':0.982791079735,'r':5}]
			},
			{label:['Рогачев: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.859345742804,'y':0.169086776696,'r':5}]
			},
			{label:['Роза: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.22274233065,'y':0.170667523833,'r':5}]
			},
			{label:['Рославль: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.712192714858,'y':0.237978603641,'r':5}]
			},
			{label:['Ростов: 5'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.531715902509,'y':0.433557530654,'r':25}]
			},
			{label:['Ростов-на-Дону: 27'],
			backgroundColor:'#e279a3',
			data:[{'x':0.676366335727,'y':0.138613326579,'r':135}]
			},
			{label:['Рудня: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.413335624555,'y':0.655353318,'r':10}]
			},
			{label:['Рыбинск: 6'],
			backgroundColor:'#9abf88',
			data:[{'x':0.037517082559,'y':0.867238368829,'r':30}]
			},
			{label:['Рылеево: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.802955069499,'y':0.286632364291,'r':5}]
			},
			{label:['Рязань: 19'],
			backgroundColor:'#e16552',
			data:[{'x':0.617403016925,'y':0.783271613496,'r':90}]
			},
			{label:['Саки: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.778950143511,'y':0.582837058132,'r':5}]
			},
			{label:['Салават: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.606193158277,'y':0.180209194328,'r':5}]
			},
			{label:['Самара: 29'],
			backgroundColor:'#9163b6',
			data:[{'x':0.13473212837,'y':0.406283345858,'r':145}]
			},
			{label:['Санкт-Петербург: 265'],
			backgroundColor:'#e16552',
			data:[{'x':0.797031256581,'y':0.642760196636,'r':265}]
			},
			{label:['Саранск: 8'],
			backgroundColor:'#e2975d',
			data:[{'x':0.47235814914,'y':0.266188852467,'r':40}]
			},
			{label:['Сарапул: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.690433230959,'y':0.398212646854,'r':5}]
			},
			{label:['Саратов: 26'],
			backgroundColor:'#51574a',
			data:[{'x':0.958389839535,'y':0.450749802136,'r':130}]
			},
			{label:['Сватово: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.035691859701,'y':0.675704332587,'r':5}]
			},
			{label:['Светлоград: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.920612078007,'y':0.0697413072221,'r':5}]
			},
			{label:['Свирск: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.426097291821,'y':0.566740527624,'r':5}]
			},
			{label:['Свободный: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.868239927935,'y':0.89238070529,'r':5}]
			},
			{label:['Севастополь: 7'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.164883629467,'y':0.665025206408,'r':35}]
			},
			{label:['Северный Коммунар: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.939335854812,'y':0.664650846492,'r':5}]
			},
			{label:['Северодвинск: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.62423503358,'y':0.317322671526,'r':10}]
			},
			{label:['Североморск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.454935989082,'y':0.193371235778,'r':5}]
			},
			{label:['Северская: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.198915415239,'y':0.199773018377,'r':5}]
			},
			{label:['Сегежа: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.043703163747,'y':0.131691313358,'r':5}]
			},
			{label:['Селятино: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.448015362053,'y':0.921005987077,'r':5}]
			},
			{label:['Сергиев Посад: 6'],
			backgroundColor:'#c94a53',
			data:[{'x':0.344119756577,'y':0.130816844863,'r':30}]
			},
			{label:['Сердобск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.97106652288,'y':0.784291547996,'r':5}]
			},
			{label:['Серпухов: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.442394116175,'y':0.532288674759,'r':10}]
			},
			{label:['Сибай: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.766862445378,'y':0.874273107976,'r':5}]
			},
			{label:['Симферополь: 11'],
			backgroundColor:'#f19670',
			data:[{'x':0.346374190692,'y':0.245493743225,'r':55}]
			},
			{label:['Славгород: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.22271957728,'y':0.722932337668,'r':5}]
			},
			{label:['Сланцы: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.440989905279,'y':0.708811612103,'r':10}]
			},
			{label:['Слободской: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.384105683627,'y':0.0627200707144,'r':5}]
			},
			{label:['Слоним: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.803227824335,'y':0.0818079041424,'r':5}]
			},
			{label:['Смоленск: 4'],
			backgroundColor:'#9abf88',
			data:[{'x':0.831212847871,'y':0.882822531616,'r':20}]
			},
			{label:['Снегири: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.480420067699,'y':0.748833290815,'r':5}]
			},
			{label:['Снежинск: 3'],
			backgroundColor:'#e16552',
			data:[{'x':0.0450857453741,'y':0.352225289452,'r':15}]
			},
			{label:['Советский: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.448621826262,'y':0.874679225728,'r':5}]
			},
			{label:['Сокол: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.051932457699,'y':0.828278345958,'r':5}]
			},
			{label:['Соледар: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.619711264421,'y':0.21942344662,'r':5}]
			},
			{label:['Солигорск: 5'],
			backgroundColor:'#e16552',
			data:[{'x':0.168356244585,'y':0.75640069711,'r':25}]
			},
			{label:['Соликамск: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.708828644982,'y':0.0258097987578,'r':10}]
			},
			{label:['Солнечногорск: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.160290113979,'y':0.52911476447,'r':10}]
			},
			{label:['Сольцы: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.612937928339,'y':0.658371457836,'r':5}]
			},
			{label:['Сосновый Бор: 4'],
			backgroundColor:'#c94a53',
			data:[{'x':0.812353388006,'y':0.257752850875,'r':20}]
			},
			{label:['Сочи: 8'],
			backgroundColor:'#e16552',
			data:[{'x':0.872282174127,'y':0.604551055118,'r':40}]
			},
			{label:['Спасск-Дальний: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.527357573422,'y':0.959966711457,'r':5}]
			},
			{label:['Спасское: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.190417401539,'y':0.674620596149,'r':5}]
			},
			{label:['Спирово: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.0239411793101,'y':0.953278839704,'r':5}]
			},
			{label:['Среднеуральск: 3'],
			backgroundColor:'#9abf88',
			data:[{'x':0.554461141557,'y':0.334615169948,'r':15}]
			},
			{label:['Ставрополь: 15'],
			backgroundColor:'#be5168',
			data:[{'x':0.110547504026,'y':0.172641098688,'r':75}]
			},
			{label:['Старотитаровская: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.230373620401,'y':0.310619937549,'r':5}]
			},
			{label:['Старый Оскол: 3'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.870057133742,'y':0.657109034365,'r':15}]
			},
			{label:['Стаханов: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.284866086628,'y':0.686799406038,'r':5}]
			},
			{label:['Степногорск: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.358007530582,'y':0.587897383633,'r':5}]
			},
			{label:['Стерлитамак: 4'],
			backgroundColor:'#e2975d',
			data:[{'x':0.279410713091,'y':0.598586259583,'r':20}]
			},
			{label:['Ступино: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.0178949518189,'y':0.961851132816,'r':5}]
			},
			{label:['Сумы: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.893886987029,'y':0.675017844653,'r':10}]
			},
			{label:['Сургут: 4'],
			backgroundColor:'#74c493',
			data:[{'x':0.0713671406117,'y':0.976789410891,'r':20}]
			},
			{label:['Сухой Лог: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.332020677212,'y':0.209887418523,'r':5}]
			},
			{label:['Сухоречка: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.180891661177,'y':0.764582554785,'r':5}]
			},
			{label:['Сызрань: 3'],
			backgroundColor:'#e16552',
			data:[{'x':0.911607111684,'y':0.12055214334,'r':15}]
			},
			{label:['Сыктывкар: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.514863889115,'y':0.649607083963,'r':5}]
			},
			{label:['Сысерть: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.282429465948,'y':0.338505007274,'r':5}]
			},
			{label:['Талдом: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.109056170718,'y':0.0224302267163,'r':10}]
			},
			{label:['Тамбов: 13'],
			backgroundColor:'#5698c4',
			data:[{'x':0.739592744634,'y':0.628842780103,'r':65}]
			},
			{label:['Тарко-Сале: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.332760914936,'y':0.112616678155,'r':5}]
			},
			{label:['Татарск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.841840593471,'y':0.957737235298,'r':5}]
			},
			{label:['Таттинский: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.477734874835,'y':0.156094881208,'r':5}]
			},
			{label:['Ташкент: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.539519531513,'y':0.987558131738,'r':5}]
			},
			{label:['Тверь: 13'],
			backgroundColor:'#e279a3',
			data:[{'x':0.0972397203173,'y':0.886229767058,'r':65}]
			},
			{label:['Тейково: 5'],
			backgroundColor:'#4e2472',
			data:[{'x':0.0827678083796,'y':0.49768408559,'r':25}]
			},
			{label:['Тель-Авив: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.0566159183861,'y':0.381913157384,'r':5}]
			},
			{label:['Тирасполь: 3'],
			backgroundColor:'#e16552',
			data:[{'x':0.00566567810247,'y':0.089744126945,'r':15}]
			},
			{label:['Тихвин: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.536028577265,'y':0.0136438936517,'r':10}]
			},
			{label:['Тобольск: 2'],
			backgroundColor:'#a34974',
			data:[{'x':0.0832683367471,'y':0.286191291325,'r':10}]
			},
			{label:['Толбазы: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.807607226247,'y':0.989289083804,'r':5}]
			},
			{label:['Толвуя: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.62577997253,'y':0.364684319346,'r':5}]
			},
			{label:['Тольятти: 7'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.665695378923,'y':0.534970811763,'r':35}]
			},
			{label:['Томск: 7'],
			backgroundColor:'#be5168',
			data:[{'x':0.892012661851,'y':0.0417702269559,'r':35}]
			},
			{label:['Топки: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.737492542516,'y':0.144485476346,'r':5}]
			},
			{label:['Торжок: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.411639578734,'y':0.704123617715,'r':10}]
			},
			{label:['Тосно: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.127317435737,'y':0.6040794817,'r':5}]
			},
			{label:['Туапсе: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.364439678788,'y':0.600985366576,'r':5}]
			},
			{label:['Тужинка: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.2205924795,'y':0.0833772281354,'r':5}]
			},
			{label:['Тула: 14'],
			backgroundColor:'#e16552',
			data:[{'x':0.92706131445,'y':0.688617169833,'r':70}]
			},
			{label:['Тутаев: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.413367927822,'y':0.351163053153,'r':5}]
			},
			{label:['Тюмень: 24'],
			backgroundColor:'#f19670',
			data:[{'x':0.245067839126,'y':0.292451011563,'r':120}]
			},
			{label:['Уварово: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.638424303184,'y':0.897830591616,'r':10}]
			},
			{label:['Уват: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.410559920098,'y':0.88296623227,'r':5}]
			},
			{label:['Углич: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.295784500155,'y':0.621148089083,'r':10}]
			},
			{label:['Удальцово: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.0324030002793,'y':0.430417309353,'r':5}]
			},
			{label:['Улан-Удэ: 5'],
			backgroundColor:'#5698c4',
			data:[{'x':0.493331614368,'y':0.342794946949,'r':25}]
			},
			{label:['Ульяновск: 12'],
			backgroundColor:'#c94a53',
			data:[{'x':0.578220021884,'y':0.268392687517,'r':60}]
			},
			{label:['Уральск: 3'],
			backgroundColor:'#a34974',
			data:[{'x':0.441528069275,'y':0.0830495322739,'r':15}]
			},
			{label:['Уржум: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.163601686199,'y':0.314980802827,'r':5}]
			},
			{label:['Урюпинск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.436619989706,'y':0.903177680953,'r':5}]
			},
			{label:['Уссурийск: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.529380566413,'y':0.28189392433,'r':10}]
			},
			{label:['Усть-Тарка: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.246840858921,'y':0.904703308791,'r':5}]
			},
			{label:['Уфа: 25'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.207531090128,'y':0.9,'r':125}]
			},
			{label:['Ухта: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.999621755026,'y':0.0146372560318,'r':5}]
			},
			{label:['Феодосия: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.511023898754,'y':0.441008233296,'r':5}]
			},
			{label:['Фрязино: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.0582227315526,'y':0.470989296122,'r':10}]
			},
			{label:['Хабаровск: 6'],
			backgroundColor:'#9abf88',
			data:[{'x':0.430384911755,'y':0.378289510875,'r':30}]
			},
			{label:['Харьков: 12'],
			backgroundColor:'#be5168',
			data:[{'x':0.991068194535,'y':0.269311772439,'r':60}]
			},
			{label:['Херсон: 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.0947126334151,'y':0.666092463593,'r':10}]
			},
			{label:['Химки: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.598782513945,'y':0.564593595867,'r':5}]
			},
			{label:['Хойники: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.707183125581,'y':0.00913150515334,'r':5}]
			},
			{label:['Чайковский: 3'],
			backgroundColor:'#c94a53',
			data:[{'x':0.448808997511,'y':0.0280707950198,'r':15}]
			},
			{label:['Чебаркуль: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.96445355555,'y':0.723027849053,'r':5}]
			},
			{label:['Чебоксары: 10'],
			backgroundColor:'#74c493',
			data:[{'x':0.214258239606,'y':0.902149543,'r':50}]
			},
			{label:['Челябинск: 42'],
			backgroundColor:'#c94a53',
			data:[{'x':0.59848853453,'y':0.00180948446917,'r':210}]
			},
			{label:['Череповец: 11'],
			backgroundColor:'#f19670',
			data:[{'x':0.791305427097,'y':0.428632368124,'r':55}]
			},
			{label:['Черкассы: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.329381523486,'y':0.184095414313,'r':5}]
			},
			{label:['Чернигов: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.165805416042,'y':0.98421291761,'r':10}]
			},
			{label:['Черновцы: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.592809950053,'y':0.297985698854,'r':10}]
			},
			{label:['Черноморское: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.534208994188,'y':0.321730739651,'r':5}]
			},
			{label:['Чернушка: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.731553057168,'y':0.431591900511,'r':5}]
			},
			{label:['Чехов: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.681172446659,'y':0.699880160552,'r':10}]
			},
			{label:['Чик: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.318314369136,'y':0.544578522379,'r':5}]
			},
			{label:['Чита: 9'],
			backgroundColor:'#e16552',
			data:[{'x':0.203610554679,'y':0.463962827438,'r':45}]
			},
			{label:['Шадринск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0379338477099,'y':0.171477468423,'r':5}]
			},
			{label:['Шатура: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.285280039872,'y':0.0150063269277,'r':10}]
			},
			{label:['Шебекино: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.0994840392059,'y':0.252826450056,'r':5}]
			},
			{label:['Шексна: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.752590565263,'y':0.421012525121,'r':5}]
			},
			{label:['Шелехов: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.448614741868,'y':0.517395418438,'r':5}]
			},
			{label:['Шугозеро: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.387332716143,'y':0.681829931038,'r':5}]
			},
			{label:['Шумерля: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.28653058046,'y':0.413847180699,'r':10}]
			},
			{label:['Шумиха: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.943173754654,'y':0.953332599379,'r':5}]
			},
			{label:['Шымкент: 4'],
			backgroundColor:'#447c69',
			data:[{'x':0.101671488102,'y':0.537699492973,'r':20}]
			},
			{label:['Щомыслица: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':3.87970161164e-06,'y':0.295485860277,'r':5}]
			},
			{label:['Щёлково: 3'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.17794070921,'y':0.809259718152,'r':15}]
			},
			{label:['Экибастуз: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.377274243922,'y':0.691825960352,'r':5}]
			},
			{label:['Электросталь: 4'],
			backgroundColor:'#a34974',
			data:[{'x':0.620799361679,'y':0.286028276954,'r':20}]
			},
			{label:['Элиста: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.855017498363,'y':0.384357325852,'r':5}]
			},
			{label:['Эльбрус: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.097586738768,'y':0.703752984822,'r':5}]
			},
			{label:['Энгельс: 4'],
			backgroundColor:'#e279a3',
			data:[{'x':0.685499847426,'y':0.741038437904,'r':20}]
			},
			{label:['Югорск: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.154225634866,'y':0.181330287136,'r':5}]
			},
			{label:['Южноуральск: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.0080077396058,'y':0.413217787192,'r':5}]
			},
			{label:['Юрга: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.196118652618,'y':0.658728443944,'r':5}]
			},
			{label:['Якутск: 7'],
			backgroundColor:'#c94a53',
			data:[{'x':0.684882034606,'y':0.339024580133,'r':35}]
			},
			{label:['Ялта: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.132253882689,'y':0.124008093806,'r':5}]
			},
			{label:['Яр: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.0422242543908,'y':0.214976158798,'r':5}]
			},
			{label:['Ярославль: 27'],
			backgroundColor:'#e2975d',
			data:[{'x':0.41277988298,'y':0.0444340208248,'r':120}]
			},
			{label:['Antalya: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.729016884673,'y':0.789690035237,'r':5}]
			},
			{label:['Bat Yam: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.651881463171,'y':0.0692788903333,'r':5}]
			},
			{label:['Bergamo: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.76105527578,'y':0.706292301504,'r':5}]
			},
			{label:['Berlin: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.310129676094,'y':0.842618934167,'r':5}]
			},
			{label:['Boston: 3'],
			backgroundColor:'#9163b6',
			data:[{'x':0.365637688789,'y':0.880481846889,'r':15}]
			},
			{label:['Bridgetown: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.334851811873,'y':0.000237214865695,'r':5}]
			},
			{label:['Brugge: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.496676025157,'y':0.920222101644,'r':5}]
			},
			{label:['Buenos Aires: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.508607272352,'y':0.981967304622,'r':5}]
			},
			{label:['California: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.516408137205,'y':0.205811402305,'r':5}]
			},
			{label:['California City: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.340767971632,'y':0.586977013081,'r':5}]
			},
			{label:['Detroit: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.833813640706,'y':0.624588185682,'r':10}]
			},
			{label:['Doha: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.872463782285,'y':0.410230737825,'r':5}]
			},
			{label:['Eindhoven: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.735248545444,'y':0.197543686551,'r':5}]
			},
			{label:['Formentera de Segura: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.989779765862,'y':0.178419171868,'r':5}]
			},
			{label:['Frankfurt am Main: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.632824948709,'y':0.745929804809,'r':10}]
			},
			{label:['Gaborone: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.53898511649,'y':0.943059495251,'r':5}]
			},
			{label:['Helsingborg: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.925767361089,'y':0.472111857423,'r':5}]
			},
			{label:['Helsinki: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.00263862135282,'y':0.180462580247,'r':10}]
			},
			{label:['London: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.0479658031067,'y':0.0177930731589,'r':10}]
			},
			{label:['Los Angeles: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.583584973072,'y':0.798897134064,'r':5}]
			},
			{label:['Luanda: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.308249140191,'y':0.885480371102,'r':5}]
			},
			{label:['Madaba: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.29546927009,'y':0.327793884092,'r':5}]
			},
			{label:['Madrid: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.772450740662,'y':0.883137522915,'r':5}]
			},
			{label:['Manchester: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.441739317572,'y':0.840618017262,'r':5}]
			},
			{label:['Miami: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.318530812486,'y':0.971935590843,'r':5}]
			},
			{label:['New York City: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.44152733147,'y':0.360632871371,'r':10}]
			},
			{label:['Nîmes: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.738696943313,'y':0.806359876607,'r':5}]
			},
			{label:['Oslo: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.276624622998,'y':0.0572771658142,'r':5}]
			},
			{label:['Philadelphia: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.373561898418,'y':0.924662709616,'r':5}]
			},
			{label:['Rio de Janeiro: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.139966155242,'y':0.153469591029,'r':5}]
			},
			{label:['Rīga: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.418086880813,'y':0.825726457539,'r':5}]
			},
			{label:['Saarbrücken: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.0480318184916,'y':0.078612184755,'r':5}]
			},
			{label:['Salzburg: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.448949227106,'y':0.759356270556,'r':5}]
			},
			{label:['Santa Monica: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.118926291923,'y':0.20719935464,'r':5}]
			},
			{label:['Sderot: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.167295809633,'y':0.378010972599,'r':5}]
			},
			{label:['Sevilla: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.0471434877664,'y':0.67436218572,'r':5}]
			},
			{label:['Stockholm: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.204755487883,'y':0.259703728767,'r':5}]
			},
			{label:['Sydney: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.749471196923,'y':0.797775709803,'r':5}]
			},
			{label:['São Paulo: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.0434836027033,'y':0.443050950223,'r':5}]
			},
			{label:['Tenkodogo: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.16414073326,'y':0.585905377768,'r':5}]
			},
			{label:['Tirana: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.997077063311,'y':0.747922504753,'r':5}]
			},
			{label:['Tokyo: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.415915248566,'y':0.865189450255,'r':5}]
			},
			{label:['Vilnius: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.608726681242,'y':0.667716633436,'r':5}]
			},
			{label:['Wilhelmshaven: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.955505079309,'y':0.278756563341,'r':5}]
			},
			{label:['Wrocław: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.445332727647,'y':0.522477544716,'r':5}]
			},
			{label:['Würzburg: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.556002640931,'y':0.783926603664,'r':5}]
			}																		
		],
		options: {
			title: {
			  display: true,
			  text: 'Города группы VK Бег 2.0'
			},
			tooltips: {
				cornerRadius: 0,
				caretSize: 0,
				xPadding: 16,
				yPadding: 10,
				backgroundColor: 'rgba(0, 150, 100, 0.9)',
				titleFontStyle: 'normal',
				titleMarginBottom: 15
			  }			
		}		
	}
});