const CITIES = document.getElementById("cch");

Chart.defaults.global.animation.duration = 3000;
Chart.defaults.scale.ticks.beginAtZero = true;


let cities_chart = new Chart(CITIES, {
    type: 'bubble',
	data: {
		datasets: [
			{label:['Абакан: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.636037917987,'y':0.534054161679,'r':20}]
			},
			{label:['Агинское: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.190904407421,'y':0.976945493993,'r':5}]
			},
			{label:['Адлер: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.653983787202,'y':0.42625439633,'r':10}]
			},
			{label:['Азнакаево: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.070306996227,'y':0.266387343853,'r':5}]
			},
			{label:['Азов: 4'],
			backgroundColor:'#447c69',
			data:[{'x':0.138117098208,'y':0.127088931431,'r':20}]
			},
			{label:['Акбулак: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.0300753794107,'y':0.143907707004,'r':5}]
			},
			{label:['Актаныш: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.11553218048,'y':0.44562973457,'r':10}]
			},
			{label:['Актау: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.702684698044,'y':0.992502051013,'r':5}]
			},
			{label:['Актобе: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.517488529876,'y':0.143008392926,'r':5}]
			},
			{label:['Александрия: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.786471580444,'y':0.733264562005,'r':5}]
			},
			{label:['Александров: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.841848848127,'y':0.986755836159,'r':5}]
			},
			{label:['Алексин: 2'],
			backgroundColor:'#a34974',
			data:[{'x':0.428273933346,'y':0.926563700511,'r':10}]
			},
			{label:['Алеховщина: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.348217234045,'y':0.359691283229,'r':5}]
			},
			{label:['Алматы: 9'],
			backgroundColor:'#9163b6',
			data:[{'x':0.708779151038,'y':0.965578210722,'r':45}]
			},
			{label:['Алушта: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.313748453334,'y':0.887018960218,'r':10}]
			},
			{label:['Алчевск: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.504128646131,'y':0.920311198292,'r':5}]
			},
			{label:['Альметьевск: 4'],
			backgroundColor:'#5698c4',
			data:[{'x':0.557265249531,'y':0.544489768405,'r':20}]
			},
			{label:['Анапа: 4'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.816259641294,'y':0.49653987975,'r':20}]
			},
			{label:['Ангарск: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.173249999951,'y':0.773297944472,'r':10}]
			},
			{label:['Апатиты: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.784857989081,'y':0.556596918085,'r':10}]
			},
			{label:['Арзамас: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.356942692355,'y':0.466515426063,'r':10}]
			},
			{label:['Армавир: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.185055588672,'y':0.703918191917,'r':5}]
			},
			{label:['Архангельск: 10'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.6,'y':0.346560880256,'r':50}]
			},
			{label:['Астана: 3'],
			backgroundColor:'#65387d',
			data:[{'x':0.449493443093,'y':0.762381924321,'r':15}]
			},
			{label:['Астрахань: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.750463726182,'y':0.183708233313,'r':10}]
			},
			{label:['Атяшево: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.2,'y':0.00459966480734,'r':5}]
			},
			{label:['Ахтубинск: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.24736529149,'y':0.559821786509,'r':5}]
			},
			{label:['Бабаево: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.504067213743,'y':0.797457405941,'r':5}]
			},
			{label:['Балаково: 3'],
			backgroundColor:'#4e2472',
			data:[{'x':0.249966543832,'y':0.452547645647,'r':15}]
			},
			{label:['Балахна: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.0606352694633,'y':0.746408234741,'r':5}]
			},
			{label:['Балашиха: 5'],
			backgroundColor:'#a34974',
			data:[{'x':0.64716961097,'y':0.430223661452,'r':25}]
			},
			{label:['Балтийск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.684514705015,'y':0.647835711057,'r':5}]
			},
			{label:['Барановичи: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.222196006185,'y':0.306269220855,'r':10}]
			},
			{label:['Барнаул: 5'],
			backgroundColor:'#447c69',
			data:[{'x':0.846803945876,'y':0.289222862003,'r':25}]
			},
			{label:['Басим: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.233244415031,'y':0.496061505942,'r':5}]
			},
			{label:['Белгород: 17'],
			backgroundColor:'#be5168',
			data:[{'x':0.348191798165,'y':0.435762275004,'r':85}]
			},
			{label:['Белово: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.302373275033,'y':0.0716321706388,'r':5}]
			},
			{label:['Белорецк: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.0679055921597,'y':0.901585617854,'r':10}]
			},
			{label:['Белореченск: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.663813260591,'y':0.144473051619,'r':5}]
			},
			{label:['Бердск: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0346669408337,'y':0.0669694946,'r':5}]
			},
			{label:['Березники: 6'],
			backgroundColor:'#e2975d',
			data:[{'x':0.965287509477,'y':0.888256801327,'r':30}]
			},
			{label:['Березно: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.856873434137,'y':0.392422823602,'r':5}]
			},
			{label:['Березовский: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.106088912086,'y':0.131078702295,'r':5}]
			},
			{label:['Бийск: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.865746322206,'y':0.610016376197,'r':5}]
			},
			{label:['Бикин: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.358436453499,'y':0.337355435359,'r':5}]
			},
			{label:['Бишкек: 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.242185150058,'y':0.893519686979,'r':10}]
			},
			{label:['Бобруйск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.812637305372,'y':0.639513649236,'r':5}]
			},
			{label:['Большие Колпаны: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.600929500232,'y':0.837584631096,'r':5}]
			},
			{label:['Бор: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.2907309816,'y':0.642902986303,'r':5}]
			},
			{label:['Борисоглебск: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.693467556207,'y':0.757987893309,'r':10}]
			},
			{label:['Борисполь: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.623181270508,'y':0.555459885789,'r':5}]
			},
			{label:['Братск: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.556216198683,'y':0.460561699908,'r':5}]
			},
			{label:['Брест: 11'],
			backgroundColor:'#993767',
			data:[{'x':0.301104770447,'y':0.439482672373,'r':55}]
			},
			{label:['Брехово: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.513738369514,'y':0.943107880454,'r':5}]
			},
			{label:['Брянка: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.536201555296,'y':0.686067720259,'r':5}]
			},
			{label:['Брянск: 9'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0879732371935,'y':0.726470123713,'r':45}]
			},
			{label:['Буздяк: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.484856220498,'y':0.0813397577532,'r':10}]
			},
			{label:['Буинск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.242726073241,'y':0.109996768937,'r':5}]
			},
			{label:['Великий Новгород: 5'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.204045571454,'y':0.304313410454,'r':25}]
			},
			{label:['Вельск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.755194517685,'y':0.974508786879,'r':5}]
			},
			{label:['Верхнедвинск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.967716581074,'y':0.87098399494,'r':5}]
			},
			{label:['Верхнеднепровский: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.169383485281,'y':0.531332796355,'r':5}]
			},
			{label:['Верхний Баскунчак: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.508363792107,'y':0.0451693461721,'r':5}]
			},
			{label:['Верхний Тагил: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.911109898661,'y':0.715305346856,'r':5}]
			},
			{label:['Верхняя Пышма: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.358960494719,'y':0.840310699056,'r':10}]
			},
			{label:['Верхняя Салда: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.730479706651,'y':0.670952801123,'r':10}]
			},
			{label:['Верхоянск: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.871013991601,'y':0.133120043901,'r':5}]
			},
			{label:['Веселый Гай: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.15254714008,'y':0.00523921435732,'r':5}]
			},
			{label:['Ветлуга: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.473765846509,'y':0.92494473216,'r':5}]
			},
			{label:['Вилейка: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.0984371316061,'y':0.301158522903,'r':5}]
			},
			{label:['Винница: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.369059254265,'y':0.451061918293,'r':10}]
			},
			{label:['Витебск: 4'],
			backgroundColor:'#e0598b',
			data:[{'x':0.771078235553,'y':0.848364807094,'r':20}]
			},
			{label:['Владивосток: 13'],
			backgroundColor:'#74c493',
			data:[{'x':0.523694662408,'y':0.00425694785728,'r':65}]
			},
			{label:['Владикавказ: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0782884969639,'y':0.20856213673,'r':5}]
			},
			{label:['Владимир: 10'],
			backgroundColor:'#e279a3',
			data:[{'x':0.622915580918,'y':0.214989524407,'r':50}]
			},
			{label:['Волгоград: 15'],
			backgroundColor:'#e16552',
			data:[{'x':0.908080238667,'y':0.143769685239,'r':75}]
			},
			{label:['Волгодонск: 5'],
			backgroundColor:'#e16552',
			data:[{'x':0.074406937096,'y':0.87177144652,'r':25}]
			},
			{label:['Волжск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.95952864272,'y':0.728291429147,'r':5}]
			},
			{label:['Волжский: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.958029775102,'y':0.625480229432,'r':10}]
			},
			{label:['Воловец: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.014093468654,'y':0.34743514655,'r':5}]
			},
			{label:['Вологда: 7'],
			backgroundColor:'#51574a',
			data:[{'x':0.0381263259922,'y':0.520984206715,'r':35}]
			},
			{label:['Волосово: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.844017717712,'y':0.348714252459,'r':5}]
			},
			{label:['Вольногорск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.00704229573621,'y':0.887266504159,'r':5}]
			},
			{label:['Вольск: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.875624958191,'y':0.701690855097,'r':10}]
			},
			{label:['Воркута: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.831450904632,'y':0.222886088356,'r':5}]
			},
			{label:['Воронеж: 14'],
			backgroundColor:'#74c493',
			data:[{'x':0.67315629366,'y':0.587110258871,'r':70}]
			},
			{label:['Воткинск: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.566713902778,'y':0.0493971878646,'r':10}]
			},
			{label:['Выборг: 4'],
			backgroundColor:'#f19670',
			data:[{'x':0.376411756518,'y':0.768173671143,'r':20}]
			},
			{label:['Вычегодский: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.0413394215539,'y':0.0396669608132,'r':5}]
			},
			{label:['Вышний Волочек: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.322342431439,'y':0.363039125975,'r':10}]
			},
			{label:['Вяземский: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.413334275911,'y':0.476985443816,'r':5}]
			},
			{label:['Вязьма: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.488745077187,'y':0.418918461948,'r':5}]
			},
			{label:['Вятские Поляны: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.672779975775,'y':0.581815832678,'r':5}]
			},
			{label:['Ганцевичи: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.283032157386,'y':0.520972074013,'r':5}]
			},
			{label:['Гатчина: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.250783444681,'y':0.944184081384,'r':10}]
			},
			{label:['Геленджик: 4'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.864679246154,'y':0.151262796401,'r':20}]
			},
			{label:['Георгиевск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.174571735028,'y':0.355624972919,'r':5}]
			},
			{label:['Гжель: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.32745552205,'y':0.121093518278,'r':5}]
			},
			{label:['Гомель: 3'],
			backgroundColor:'#e16552',
			data:[{'x':0.217097325038,'y':0.376128701223,'r':15}]
			},
			{label:['Горно-Алтайск: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.0415957233788,'y':0.277637855304,'r':10}]
			},
			{label:['Горноуральский: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.76106140987,'y':0.41441249364,'r':5}]
			},
			{label:['Гродно: 4'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.769898632276,'y':0.0875322313633,'r':20}]
			},
			{label:['Грозный: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.241875251277,'y':0.280579788105,'r':5}]
			},
			{label:['Грязовец: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.677312712704,'y':0.796706451571,'r':5}]
			},
			{label:['Губкинский: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.159473466925,'y':0.373985048523,'r':5}]
			},
			{label:['Гуково: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.521307144029,'y':0.875008815696,'r':10}]
			},
			{label:['Гурьевск: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.875366420665,'y':0.734370199485,'r':5}]
			},
			{label:['Гусь-Хрустальный: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.342644518642,'y':0.227916171073,'r':5}]
			},
			{label:['Данилов: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.821103474888,'y':0.182917229614,'r':15}]
			},
			{label:['Дебальцево: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.775413725717,'y':0.34069916735,'r':5}]
			},
			{label:['Дегтярск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.197137257028,'y':0.655102764171,'r':5}]
			},
			{label:['Десногорск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.686634147032,'y':0.440924254616,'r':5}]
			},
			{label:['Дзержинск: 6'],
			backgroundColor:'#447c69',
			data:[{'x':0.908279009804,'y':0.749663880886,'r':30}]
			},
			{label:['Димитровград: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.0155281767369,'y':0.976020057998,'r':5}]
			},
			{label:['Дмитров: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.574592811444,'y':0.227138836685,'r':10}]
			},
			{label:['Днепропетровск (Днепр): 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.761430027939,'y':0.534960973433,'r':10}]
			},
			{label:['Добрянка: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.82906990297,'y':0.702952912816,'r':5}]
			},
			{label:['Домодедово: 3'],
			backgroundColor:'#5698c4',
			data:[{'x':0.230077356968,'y':0.071103335492,'r':15}]
			},
			{label:['Донецк: 9'],
			backgroundColor:'#9163b6',
			data:[{'x':0.00648370837984,'y':0.447080240265,'r':45}]
			},
			{label:['Дружковка: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.657838685073,'y':0.694688565003,'r':5}]
			},
			{label:['Дружный: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.0818838656368,'y':0.167019993246,'r':5}]
			},
			{label:['Дубна: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.573720709994,'y':0.262241479204,'r':10}]
			},
			{label:['Дятьково: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.762269676822,'y':0.916802144844,'r':5}]
			},
			{label:['Ейск: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.991421349477,'y':0.706635968691,'r':5}]
			},
			{label:['Екатеринбург: 46'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.405190488828,'y':0.736052494226,'r':230}]
			},
			{label:['Елабуга: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.715388598713,'y':0.481277570312,'r':10}]
			},
			{label:['Елань: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.465251837636,'y':0.10834353476,'r':5}]
			},
			{label:['Елец: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.103106057982,'y':0.00507967200275,'r':10}]
			},
			{label:['Железнодорожный (Балашиха): 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.315921680893,'y':0.658535099304,'r':10}]
			},
			{label:['Жигулевск: 3'],
			backgroundColor:'#be5168',
			data:[{'x':0.323357027489,'y':0.528824298948,'r':15}]
			},
			{label:['Житомир: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.0813899227039,'y':0.038363975859,'r':5}]
			},
			{label:['Жлобин: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.660697382703,'y':0.847647778199,'r':5}]
			},
			{label:['Жуковский: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.199503381126,'y':0.429608799117,'r':5}]
			},
			{label:['Задонск: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.953222999463,'y':0.988872640796,'r':5}]
			},
			{label:['Зайсан: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.590095084975,'y':0.118659629107,'r':5}]
			},
			{label:['Заокский: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.348658820196,'y':0.289212304217,'r':5}]
			},
			{label:['Запорожье: 6'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0478936971619,'y':0.554201380218,'r':30}]
			},
			{label:['Заречное: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.808655798784,'y':0.599041860527,'r':5}]
			},
			{label:['Звенигород: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.21672757686,'y':0.450380543724,'r':5}]
			},
			{label:['Зеленоград: 4'],
			backgroundColor:'#9163b6',
			data:[{'x':0.137365104898,'y':0.169741237544,'r':20}]
			},
			{label:['Зима: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.990168239541,'y':0.749609863326,'r':10}]
			},
			{label:['Златоуст: 3'],
			backgroundColor:'#9163b6',
			data:[{'x':0.330466351923,'y':0.634095802656,'r':15}]
			},
			{label:['Змиев: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.254668924743,'y':0.408637131957,'r':5}]
			},
			{label:['Знаменск: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.863199776397,'y':0.0638965839188,'r':10}]
			},
			{label:['Ибреси: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.539104809668,'y':0.967205807035,'r':5}]
			},
			{label:['Иваново: 7'],
			backgroundColor:'#e16552',
			data:[{'x':0.787037285649,'y':0.496215222347,'r':35}]
			},
			{label:['Ивантеевка: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.248300204235,'y':0.932363772915,'r':5}]
			},
			{label:['Иерусалим: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.109755984807,'y':0.423398322889,'r':5}]
			},
			{label:['Ижевск: 15'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.194614749877,'y':0.338788962674,'r':75}]
			},
			{label:['Ирбит: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.625815309206,'y':0.762334665053,'r':5}]
			},
			{label:['Иркутск: 7'],
			backgroundColor:'#5698c4',
			data:[{'x':0.365290589168,'y':0.47475448654,'r':35}]
			},
			{label:['Ишим: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.273820071164,'y':0.577541051577,'r':5}]
			},
			{label:['Ишимбай: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.286007005253,'y':0.511340076719,'r':5}]
			},
			{label:['Йошкар-Ола: 7'],
			backgroundColor:'#c94a53',
			data:[{'x':0.958907208725,'y':0.179468478919,'r':35}]
			},
			{label:['Кагул: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.394582633511,'y':0.393605783371,'r':5}]
			},
			{label:['Кадуй: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.261287271817,'y':0.780625807019,'r':5}]
			},
			{label:['Казань: 19'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.868909202869,'y':0.723309756023,'r':95}]
			},
			{label:['Калининград: 20'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.422998232329,'y':0.611523004102,'r':100}]
			},
			{label:['Калуга: 10'],
			backgroundColor:'#e279a3',
			data:[{'x':0.950224025822,'y':0.874241150133,'r':50}]
			},
			{label:['Каменское / Днепродзержинск: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.796894486496,'y':0.0855201101142,'r':10}]
			},
			{label:['Камень-Каширский: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.723201592312,'y':0.608739888062,'r':5}]
			},
			{label:['Камышин: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.894527311467,'y':0.730067098121,'r':15}]
			},
			{label:['Карабаново: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.386017989207,'y':0.774372319224,'r':5}]
			},
			{label:['Карагай: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.698953469529,'y':0.590143976987,'r':5}]
			},
			{label:['Караганда: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0329812379248,'y':0.517356794615,'r':5}]
			},
			{label:['Карачев: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.570366142104,'y':0.935473128432,'r':5}]
			},
			{label:['Карпинск: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.894845478206,'y':0.874442661753,'r':10}]
			},
			{label:['Каспийск: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.0146785158305,'y':0.207871643425,'r':5}]
			},
			{label:['Качканар: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.470083990357,'y':0.667036489647,'r':5}]
			},
			{label:['Кашира: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.991567842329,'y':0.427145743065,'r':5}]
			},
			{label:['Кемерово: 9'],
			backgroundColor:'#c94a53',
			data:[{'x':0.143921685292,'y':0.0777502504173,'r':45}]
			},
			{label:['Керчь: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.137067616415,'y':0.118306003177,'r':5}]
			},
			{label:['Киев: 13'],
			backgroundColor:'#f19670',
			data:[{'x':0.241657517514,'y':0.226066025088,'r':65}]
			},
			{label:['Кимры: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.656260676297,'y':0.211537796891,'r':5}]
			},
			{label:['Кинешма: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.926115020015,'y':0.111991506067,'r':10}]
			},
			{label:['Киржач: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.335411281859,'y':0.802137213238,'r':5}]
			},
			{label:['Кириши: 3'],
			backgroundColor:'#993767',
			data:[{'x':0.815051582957,'y':0.748251245091,'r':15}]
			},
			{label:['Киров: 11'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0582383939997,'y':0.427145883263,'r':55}]
			},
			{label:['Кирово-Чепецк: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.531385874483,'y':0.796381922075,'r':5}]
			},
			{label:['Кислово: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.750073879816,'y':0.84734258717,'r':5}]
			},
			{label:['Кисловодск: 4'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.736479109095,'y':0.784852175643,'r':20}]
			},
			{label:['Клин: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.515383563986,'y':0.797450257985,'r':10}]
			},
			{label:['Ковдор: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.290541708725,'y':0.204178991027,'r':5}]
			},
			{label:['Ковель: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.784693695696,'y':0.618563484223,'r':5}]
			},
			{label:['Ковров: 4'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.25870437566,'y':0.238681139037,'r':20}]
			},
			{label:['Ковылкино: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.514989930537,'y':0.686987113908,'r':5}]
			},
			{label:['Козельск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.221412862707,'y':0.538955687957,'r':5}]
			},
			{label:['Коломна: 6'],
			backgroundColor:'#e0598b',
			data:[{'x':0.826102812917,'y':0.305976645309,'r':30}]
			},
			{label:['Комрат: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.260009369245,'y':0.878526947359,'r':5}]
			},
			{label:['Комсомольск-на-Амуре: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.564035361188,'y':0.996562124747,'r':10}]
			},
			{label:['Конаково: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.47967003144,'y':0.788308297904,'r':5}]
			},
			{label:['Кондопога: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.353770425409,'y':0.356921664097,'r':5}]
			},
			{label:['Коновалово: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.878334427408,'y':0.157337877791,'r':5}]
			},
			{label:['Конотоп: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.92143679556,'y':0.401267648223,'r':5}]
			},
			{label:['Копейск: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.858045810733,'y':0.334930525061,'r':5}]
			},
			{label:['Королёв: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.94028899464,'y':0.642694463834,'r':20}]
			},
			{label:['Корсаков: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.728427154735,'y':0.627402824359,'r':5}]
			},
			{label:['Корткерос: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.802961216849,'y':0.426553514473,'r':5}]
			},
			{label:['Костанай: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.967942494549,'y':0.260131426664,'r':10}]
			},
			{label:['Костомукша: 13'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.26248424614,'y':0.897100633062,'r':65}]
			},
			{label:['Кострома: 4'],
			backgroundColor:'#993767',
			data:[{'x':0.978942232187,'y':0.515189315402,'r':20}]
			},
			{label:['Красноармейск: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.474249991501,'y':0.711957034015,'r':5}]
			},
			{label:['Красногорск: 3'],
			backgroundColor:'#f19670',
			data:[{'x':0.514009510076,'y':0.44956527962,'r':15}]
			},
			{label:['Красноград: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.603423297546,'y':0.662909028387,'r':5}]
			},
			{label:['Краснодар: 33'],
			backgroundColor:'#993767',
			data:[{'x':0.383034715461,'y':0.0546158269427,'r':165}]
			},
			{label:['Краснодон: 4'],
			backgroundColor:'#65387d',
			data:[{'x':0.624455563339,'y':0.181225086653,'r':20}]
			},
			{label:['Краснознаменск: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.253583770479,'y':0.0339973920072,'r':15}]
			},
			{label:['Красноярск: 9'],
			backgroundColor:'#993767',
			data:[{'x':0.527342899764,'y':0.0790089717683,'r':45}]
			},
			{label:['Красный Стекловар: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.856194889062,'y':0.33227368985,'r':5}]
			},
			{label:['Кременчуг: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.763907717819,'y':0.337892318637,'r':5}]
			},
			{label:['Крестцы: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.572288777926,'y':0.577336728827,'r':5}]
			},
			{label:['Кривой Рог: 3'],
			backgroundColor:'#4e2472',
			data:[{'x':0.0725881703376,'y':0.850574639721,'r':15}]
			},
			{label:['Кропачёво: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.355291962509,'y':0.739330467753,'r':5}]
			},
			{label:['Кропивницкий / Кировоград: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.212957934432,'y':0.00597785995577,'r':10}]
			},
			{label:['Кстово: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.509749925808,'y':0.0348811746445,'r':10}]
			},
			{label:['Кузнецк: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.417144504639,'y':0.885765708717,'r':5}]
			},
			{label:['Кулебаки: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.216605005848,'y':0.726069216923,'r':5}]
			},
			{label:['Кумертау: 4'],
			backgroundColor:'#e279a3',
			data:[{'x':0.573701220507,'y':0.658008611389,'r':20}]
			},
			{label:['Кунгур: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.370584282566,'y':0.706776552007,'r':5}]
			},
			{label:['Курган: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.164530238562,'y':0.867174974009,'r':5}]
			},
			{label:['Куровское: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.774654427785,'y':0.680725700112,'r':5}]
			},
			{label:['Курск: 8'],
			backgroundColor:'#4e2472',
			data:[{'x':0.881248480932,'y':0.511776516089,'r':40}]
			},
			{label:['Курчатов: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.92773569188,'y':0.704805699865,'r':10}]
			},
			{label:['Кызылорда : 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.403727998855,'y':0.452044564955,'r':5}]
			},
			{label:['Кыштым: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.690998305455,'y':0.254697838217,'r':5}]
			},
			{label:['Лангепас: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.309600580881,'y':0.872508534874,'r':5}]
			},
			{label:['Лахденпохья: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.102885590694,'y':0.702399797852,'r':5}]
			},
			{label:['Лениногорск: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.886493080461,'y':0.153038885905,'r':20}]
			},
			{label:['Ленинск-Кузнецкий: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.131841724021,'y':0.96888208555,'r':5}]
			},
			{label:['Лесной: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.514635910718,'y':0.641601103081,'r':10}]
			},
			{label:['Лесосибирск: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.771096657293,'y':0.652792595289,'r':10}]
			},
			{label:['Ливны: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0863700525726,'y':0.768279856928,'r':10}]
			},
			{label:['Ликино-Дулево: 3'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.0519476242126,'y':0.729396767291,'r':15}]
			},
			{label:['Липецк: 11'],
			backgroundColor:'#447c69',
			data:[{'x':0.482928882861,'y':0.778420644502,'r':55}]
			},
			{label:['Лобня: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.0590120076787,'y':0.0635715470317,'r':10}]
			},
			{label:['Лосино-Петровский: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.44645296393,'y':0.203144496403,'r':5}]
			},
			{label:['Луганск: 3'],
			backgroundColor:'#65387d',
			data:[{'x':0.916414477377,'y':0.49817885929,'r':15}]
			},
			{label:['Луховицы: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.357870890501,'y':0.610397900102,'r':5}]
			},
			{label:['Львов: 4'],
			backgroundColor:'#e279a3',
			data:[{'x':0.779508711157,'y':0.0562289202027,'r':20}]
			},
			{label:['Люберцы: 4'],
			backgroundColor:'#e2975d',
			data:[{'x':0.160093526984,'y':0.505554863639,'r':20}]
			},
			{label:['Люботин: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.33802034503,'y':0.0726953309649,'r':5}]
			},
			{label:['Людиново: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.604900748003,'y':0.505094383329,'r':10}]
			},
			{label:['Магадан: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.162783743398,'y':0.220615788302,'r':5}]
			},
			{label:['Магнитогорск: 4'],
			backgroundColor:'#a34974',
			data:[{'x':0.535097885366,'y':0.826713334886,'r':20}]
			},
			{label:['Майкоп: 3'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.66363527489,'y':0.300982538032,'r':15}]
			},
			{label:['Малин: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.754792892172,'y':0.800694720695,'r':5}]
			},
			{label:['Манжерок: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.245928933845,'y':0.65977141651,'r':5}]
			},
			{label:['Мариинский Посад: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.958834398967,'y':0.301964049252,'r':5}]
			},
			{label:['Мариуполь: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.768275650917,'y':0.35636508059,'r':10}]
			},
			{label:['Махачкала: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.308194694778,'y':0.360539289704,'r':10}]
			},
			{label:['Медвежий Угол: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.0679863464246,'y':0.943902744955,'r':5}]
			},
			{label:['Медвежьегорск: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.715372859246,'y':0.942712803674,'r':5}]
			},
			{label:['Мелеуз: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.389355664243,'y':0.571516093715,'r':5}]
			},
			{label:['Миасс: 4'],
			backgroundColor:'#e0598b',
			data:[{'x':0.654937440639,'y':0.733174454256,'r':20}]
			},
			{label:['Микунь: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.692680920259,'y':0.405585248241,'r':10}]
			},
			{label:['Минеральные Воды: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.901646556468,'y':0.992086616236,'r':5}]
			},
			{label:['Минск: 24'],
			backgroundColor:'#be5168',
			data:[{'x':0.751197072939,'y':0.236250246724,'r':120}]
			},
			{label:['Минусинск: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.581225130473,'y':0.762496852086,'r':10}]
			},
			{label:['Мирный: 4'],
			backgroundColor:'#f19670',
			data:[{'x':0.582987935247,'y':0.763102151416,'r':20}]
			},
			{label:['Мичуринск: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.514483420142,'y':0.479998628455,'r':10}]
			},
			{label:['Могилёв: 5'],
			backgroundColor:'#e279a3',
			data:[{'x':0.801521832283,'y':0.535865312349,'r':25}]
			},
			{label:['Молодечно: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.644839575407,'y':0.249561690571,'r':5}]
			},
			{label:['Монино: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.95648414226,'y':0.449165779157,'r':10}]
			},
			{label:['Мончегорск: 3'],
			backgroundColor:'#65387d',
			data:[{'x':0.5,'y':0.15,'r':15}]
			},
			{label:['Морозовск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.7734293208,'y':0.920389591787,'r':5}]
			},
			{label:['Москва: 382'],
			backgroundColor:'#e16552',
			data:[{'x':0.769587567759,'y':0.4,'r':300}]
			},
			{label:['Мурманск: 21'],
			backgroundColor:'#4e2472',
			data:[{'x':0.337327282888,'y':0.145737448202,'r':105}]
			},
			{label:['Муром: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0340984826911,'y':0.194775941752,'r':10}]
			},
			{label:['Мценск: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.750423445823,'y':0.414532994938,'r':5}]
			},
			{label:['Мытищи: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.482344108336,'y':0.0288426002622,'r':10}]
			},
			{label:['Мышкин: 4'],
			backgroundColor:'#5698c4',
			data:[{'x':0.157266802738,'y':0.768759537052,'r':20}]
			},
			{label:['Набережные Челны: 14'],
			backgroundColor:'#be5168',
			data:[{'x':0.1,'y':0.83,'r':70}]
			},
			{label:['Навашино: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.692341115524,'y':0.118266269674,'r':5}]
			},
			{label:['Налобиха: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.547478622302,'y':0.497437821194,'r':5}]
			},
			{label:['Нальчик: 3'],
			backgroundColor:'#c94a53',
			data:[{'x':0.205439627137,'y':0.60542270914,'r':15}]
			},
			{label:['Наро-Фоминск: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.0366400782592,'y':0.120895593487,'r':5}]
			},
			{label:['Нарьян-Мар: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.740957571474,'y':0.384255996819,'r':5}]
			},
			{label:['Невель: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.198980109194,'y':0.904930806229,'r':5}]
			},
			{label:['Невинномысск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.431047562634,'y':0.811402417808,'r':5}]
			},
			{label:['Невьянск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.293469983004,'y':0.194616244264,'r':5}]
			},
			{label:['Нерюнгри: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.399897109196,'y':0.409067544828,'r':5}]
			},
			{label:['Несолонь: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.366282184985,'y':0.182364658627,'r':5}]
			},
			{label:['Нефтекамск: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.518277929042,'y':0.590485555221,'r':5}]
			},
			{label:['Нефтеюганск: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.960562234048,'y':0.0362824401347,'r':10}]
			},
			{label:['Нижневартовск: 5'],
			backgroundColor:'#be5168',
			data:[{'x':0.594414315677,'y':0.77956914843,'r':25}]
			},
			{label:['Нижнекамск: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.386056014833,'y':0.246720980776,'r':10}]
			},
			{label:['Нижний Новгород: 37'],
			backgroundColor:'#e279a3',
			data:[{'x':0.445349935886,'y':0.0763642250586,'r':185}]
			},
			{label:['Нижний Тагил: 8'],
			backgroundColor:'#5698c4',
			data:[{'x':0.0602075448483,'y':0.886902206769,'r':40}]
			},
			{label:['Николаев: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.73644289093,'y':0.845544994273,'r':5}]
			},
			{label:['Никольск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.845914503102,'y':0.16628449649,'r':5}]
			},
			{label:['Нововоронеж: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.0736183066485,'y':0.241462904746,'r':10}]
			},
			{label:['Новое Юшкозеро: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.101820561535,'y':0.392180823651,'r':5}]
			},
			{label:['Новокузнецк: 3'],
			backgroundColor:'#51574a',
			data:[{'x':0.0692740325782,'y':0.0921005099345,'r':15}]
			},
			{label:['Новомичуринск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.270559026053,'y':0.954485398499,'r':5}]
			},
			{label:['Новомосковск: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.378554146473,'y':0.890725349606,'r':5}]
			},
			{label:['Новополоцк: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.628059395858,'y':0.313907431622,'r':5}]
			},
			{label:['Новосибирск: 34'],
			backgroundColor:'#a34974',
			data:[{'x':0.823059066653,'y':0.198125040507,'r':170}]
			},
			{label:['Новоугольный: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.384167632445,'y':0.0914277498947,'r':5}]
			},
			{label:['Новоуральск: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.994494644231,'y':0.250216414811,'r':5}]
			},
			{label:['Новочебоксарск: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.252307372789,'y':0.461611507332,'r':15}]
			},
			{label:['Новочеркасск: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.0862787926452,'y':0.893182271743,'r':5}]
			},
			{label:['Новошахтинск: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.31978440049,'y':0.123458068007,'r':5}]
			},
			{label:['Новый Уренгой: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.186256817638,'y':0.465660258618,'r':5}]
			},
			{label:['Ноябрьск: 2'],
			backgroundColor:'#e279a3',
			data:[{'x':0.7,'y':4.64802854919e-05,'r':10}]
			},
			{label:['Нытва: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.669020218779,'y':0.849038493639,'r':5}]
			},
			{label:['Нягань: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.654530167718,'y':0.949001992878,'r':5}]
			},
			{label:['Няндома: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.851276197949,'y':0.659426203068,'r':10}]
			},
			{label:['Обнинск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.98,'y':0.218529452867,'r':5}]
			},
			{label:['Одесса: 7'],
			backgroundColor:'#e279a3',
			data:[{'x':0.15,'y':0.99,'r':35}]
			},
			{label:['Одинцово: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.251225921964,'y':0.816461844911,'r':5}]
			},
			{label:['Озерск: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.25635663899,'y':0.780230445579,'r':10}]
			},
			{label:['Озёры: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.335572522286,'y':0.88055376055,'r':5}]
			},
			{label:['Октябрьский: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.333987086874,'y':0.307989755919,'r':5}]
			},
			{label:['Оленегорск: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.181399026698,'y':0.622693476397,'r':10}]
			},
			{label:['Омск: 12'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.191028737916,'y':0.115757957797,'r':60}]
			},
			{label:['Оренбург: 5'],
			backgroundColor:'#4e2472',
			data:[{'x':0.757265149578,'y':0.774689775418,'r':25}]
			},
			{label:['Орехово-Зуево: 3'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.995468255286,'y':0.418702815979,'r':15}]
			},
			{label:['Орск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.115778885423,'y':0.368826191782,'r':5}]
			},
			{label:['Орша: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.365064729497,'y':0.143125735345,'r':5}]
			},
			{label:['Орёл: 8'],
			backgroundColor:'#447c69',
			data:[{'x':0.505970991461,'y':0.0283248750278,'r':40}]
			},
			{label:['Оса: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.569509447055,'y':0.974264904367,'r':5}]
			},
			{label:['Осиповичи: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.128041050491,'y':0.420714080384,'r':5}]
			},
			{label:['Острог: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.213838707671,'y':0.0279111863444,'r':5}]
			},
			{label:['Оха: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.815160809792,'y':0.826422086858,'r':5}]
			},
			{label:['Оханск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.729343065234,'y':0.453141593151,'r':5}]
			},
			{label:['Павлово: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.29703960218,'y':0.872031830401,'r':5}]
			},
			{label:['Павловская: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.474160092444,'y':0.0812339474861,'r':5}]
			},
			{label:['Павловский Посад: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.47017966915,'y':0.869177412615,'r':5}]
			},
			{label:['Павлодар: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.261178439925,'y':0.306201646447,'r':10}]
			},
			{label:['Пенза: 8'],
			backgroundColor:'#5698c4',
			data:[{'x':0.28477729669,'y':0.980260494571,'r':40}]
			},
			{label:['Первоуральск: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0443285650225,'y':0.476666552185,'r':5}]
			},
			{label:['Переславль-Залесский: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.724920898043,'y':0.498935391123,'r':5}]
			},
			{label:['Пермь: 40'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.136899709391,'y':0.438708689244,'r':200}]
			},
			{label:['Петрозаводск: 10'],
			backgroundColor:'#be5168',
			data:[{'x':0.902047108797,'y':0.310485429115,'r':50}]
			},
			{label:['Петропавловск: 4'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.790684643559,'y':0.792400633281,'r':20}]
			},
			{label:['Петропавловск-Камчатский: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.271695812032,'y':0.407586578034,'r':10}]
			},
			{label:['Пиль-Егор: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.959344003943,'y':0.374387598192,'r':5}]
			},
			{label:['Пинск: 3'],
			backgroundColor:'#e279a3',
			data:[{'x':0.122989831124,'y':0.253516587273,'r':15}]
			},
			{label:['Пионерский: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.29387710342,'y':0.551474379379,'r':5}]
			},
			{label:['Питер: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.00967622302415,'y':0.196649493771,'r':5}]
			},
			{label:['Платнировская: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.167074474899,'y':0.0220675389911,'r':5}]
			},
			{label:['Плеханово: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.199610639434,'y':0.168984291235,'r':5}]
			},
			{label:['Подольск: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.25,'y':0.0797613873296,'r':5}]
			},
			{label:['Подстепки: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.516981676756,'y':0.445235109278,'r':5}]
			},
			{label:['Пойковский: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.346021963233,'y':0.0807022096817,'r':5}]
			},
			{label:['Полевской: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.363299142066,'y':0.0820984999689,'r':15}]
			},
			{label:['Полоцк: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.573119396523,'y':0.505229185838,'r':5}]
			},
			{label:['Полярный: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.882959556127,'y':0.631586574305,'r':5}]
			},
			{label:['Похвистнево: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.55406044188,'y':0.955736158954,'r':5}]
			},
			{label:['Почапки: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.487482303226,'y':0.638162839337,'r':5}]
			},
			{label:['Прилуки: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.841864401857,'y':0.552128696518,'r':5}]
			},
			{label:['Протвино: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.469955245578,'y':0.153981915416,'r':5}]
			},
			{label:['Псков: 8'],
			backgroundColor:'#be5168',
			data:[{'x':0.406988582227,'y':0.494714445387,'r':40}]
			},
			{label:['Пугачев: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.75328998934,'y':0.451937777243,'r':5}]
			},
			{label:['Пудож: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.157199695305,'y':0.378625517984,'r':5}]
			},
			{label:['Пучеж: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.0203507293939,'y':0.090615974347,'r':5}]
			},
			{label:['Пушкин: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.86035876783,'y':0.609698218087,'r':10}]
			},
			{label:['Пушкино: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.752784811758,'y':0.545351550546,'r':5}]
			},
			{label:['Радужный: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.0507026844467,'y':0.296955262536,'r':5}]
			},
			{label:['Раменское: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.803741156828,'y':0.192970161798,'r':5}]
			},
			{label:['Ревда: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.216597168198,'y':0.452789313939,'r':10}]
			},
			{label:['Ришон ЛеЦион: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.966710295805,'y':0.190052025704,'r':5}]
			},
			{label:['Ровно: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.68989269642,'y':0.878781336687,'r':5}]
			},
			{label:['Рогачев: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.00262528983205,'y':0.273527434837,'r':5}]
			},
			{label:['Роза: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.68496644477,'y':0.566028205267,'r':5}]
			},
			{label:['Рославль: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.135659334395,'y':0.940615668432,'r':5}]
			},
			{label:['Ростов: 5'],
			backgroundColor:'#9abf88',
			data:[{'x':0.646853627521,'y':0.829603419282,'r':25}]
			},
			{label:['Ростов-на-Дону: 27'],
			backgroundColor:'#65387d',
			data:[{'x':0.719476447654,'y':0.588173858638,'r':135}]
			},
			{label:['Рудня: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.236552535595,'y':0.104070998138,'r':5}]
			},
			{label:['Рыбинск: 6'],
			backgroundColor:'#c94a53',
			data:[{'x':0.657040016703,'y':0.0411201325041,'r':30}]
			},
			{label:['Рылеево: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.865998200623,'y':0.0414413752381,'r':5}]
			},
			{label:['Рязань: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.618186188609,'y':0.554736120658,'r':5}]
			},
			{label:['Саки: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.054746460034,'y':0.876592921403,'r':5}]
			},
			{label:['Салават: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.894485631726,'y':0.19433761101,'r':5}]
			},
			{label:['Самара: 28'],
			backgroundColor:'#65387d',
			data:[{'x':0.735775647852,'y':0.9,'r':140}]
			},
			{label:['Санкт-Петербург: 258'],
			backgroundColor:'#a34974',
			data:[{'x':0.525680938532,'y':0.685687746347,'r':258}]
			},
			{label:['Саранск: 7'],
			backgroundColor:'#447c69',
			data:[{'x':0.807367628489,'y':0.294798804827,'r':35}]
			},
			{label:['Сарапул: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.360307952874,'y':0.136828739823,'r':5}]
			},
			{label:['Саратов: 25'],
			backgroundColor:'#be5168',
			data:[{'x':0.809479754684,'y':0.164041030437,'r':125}]
			},
			{label:['Сватово: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.568809939439,'y':0.957981209521,'r':5}]
			},
			{label:['Свирск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.729416980182,'y':0.301433459101,'r':5}]
			},
			{label:['Свободный: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.273244752616,'y':0.471001206619,'r':5}]
			},
			{label:['Севастополь: 7'],
			backgroundColor:'#e16552',
			data:[{'x':0.455649119104,'y':0.574841480487,'r':35}]
			},
			{label:['Северодвинск: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.452609520049,'y':0.0590355575478,'r':10}]
			},
			{label:['Североморск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.0614374801679,'y':0.227617565309,'r':5}]
			},
			{label:['Северская: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.797639346956,'y':0.0246816721083,'r':5}]
			},
			{label:['Сегежа: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.113017147761,'y':0.601822514276,'r':5}]
			},
			{label:['Селятино: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.482303350251,'y':0.000711268873706,'r':5}]
			},
			{label:['Сергиев Посад: 6'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.979991726914,'y':0.832610335661,'r':30}]
			},
			{label:['Сердобск: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.352701106075,'y':0.337554225688,'r':5}]
			},
			{label:['Серпухов: 2'],
			backgroundColor:'#a34974',
			data:[{'x':0.37538577432,'y':0.683280107176,'r':10}]
			},
			{label:['Сибай: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.858560568082,'y':0.483726701538,'r':5}]
			},
			{label:['Симферополь: 11'],
			backgroundColor:'#e0598b',
			data:[{'x':0.510618977961,'y':0.801605821368,'r':55}]
			},
			{label:['Славгород: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.396201062948,'y':0.267806431832,'r':5}]
			},
			{label:['Сланцы: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.237879737134,'y':0.32661976295,'r':10}]
			},
			{label:['Слоним: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.00728227686761,'y':0.475795911617,'r':5}]
			},
			{label:['Смоленск: 4'],
			backgroundColor:'#e279a3',
			data:[{'x':0.221406407088,'y':0.651168897299,'r':20}]
			},
			{label:['Снегири: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.702182427669,'y':0.806329279273,'r':5}]
			},
			{label:['Снежинск: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.9260079092,'y':0.966285340287,'r':10}]
			},
			{label:['Советский: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.283377149149,'y':0.537809283262,'r':5}]
			},
			{label:['Сокол: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.484534502975,'y':0.778996109659,'r':5}]
			},
			{label:['Соледар: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.244248835783,'y':0.227848823968,'r':5}]
			},
			{label:['Солигорск: 5'],
			backgroundColor:'#993767',
			data:[{'x':0.823552661559,'y':0.331932678725,'r':25}]
			},
			{label:['Соликамск: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.211869331854,'y':0.597222694659,'r':10}]
			},
			{label:['Солнечногорск: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.118583519367,'y':0.258871644193,'r':10}]
			},
			{label:['Сольцы: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.52820466161,'y':0.337434106579,'r':5}]
			},
			{label:['Сосновый Бор: 4'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.554086538614,'y':0.0226529701835,'r':20}]
			},
			{label:['Сочи: 7'],
			backgroundColor:'#f19670',
			data:[{'x':0.836073824545,'y':0.730307543865,'r':35}]
			},
			{label:['Спасск-Дальний: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.892794524918,'y':0.808541401121,'r':5}]
			},
			{label:['Спасское: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.368609789105,'y':0.65801608726,'r':5}]
			},
			{label:['Спирово: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.081643519986,'y':0.433073085357,'r':5}]
			},
			{label:['Среднеуральск: 3'],
			backgroundColor:'#a34974',
			data:[{'x':0.60524953533,'y':0.0415884910527,'r':15}]
			},
			{label:['Ставрополь: 14'],
			backgroundColor:'#74c493',
			data:[{'x':0.74683697192,'y':0.825286308318,'r':70}]
			},
			{label:['Старый Оскол: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.641108316452,'y':0.402896246678,'r':15}]
			},
			{label:['Стаханов: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.346939522301,'y':0.842443258383,'r':5}]
			},
			{label:['Степногорск: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.244708412363,'y':0.547049127545,'r':5}]
			},
			{label:['Стерлитамак: 4'],
			backgroundColor:'#51574a',
			data:[{'x':0.327137060458,'y':0.99,'r':20}]
			},
			{label:['Ступино: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.95961670119,'y':0.807790688341,'r':5}]
			},
			{label:['Сумы: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.411557325483,'y':0.753623716656,'r':10}]
			},
			{label:['Сургут: 4'],
			backgroundColor:'#a34974',
			data:[{'x':0.021299872152,'y':0.0361669684869,'r':20}]
			},
			{label:['Сухой Лог: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.5597565784,'y':0.628267211163,'r':5}]
			},
			{label:['Сухоречка: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.23683233933,'y':0.234462271263,'r':5}]
			},
			{label:['Сызрань: 2'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.655599614214,'y':0.940398512109,'r':10}]
			},
			{label:['Сыктывкар: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.00580058455929,'y':0.503331797217,'r':5}]
			},
			{label:['Сысерть: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.869361878246,'y':0.961239602288,'r':5}]
			},
			{label:['Талдом: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.171795103719,'y':0.283762177236,'r':10}]
			},
			{label:['Тамбов: 13'],
			backgroundColor:'#be5168',
			data:[{'x':0.597801089103,'y':0.688424681806,'r':65}]
			},
			{label:['Тарко-Сале: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.85560516041,'y':0.562889022161,'r':5}]
			},
			{label:['Татарск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.0100838915066,'y':0.499836385507,'r':5}]
			},
			{label:['Таттинский: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.409045988803,'y':0.290331698914,'r':5}]
			},
			{label:['Ташкент: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.79148200242,'y':0.719606136397,'r':5}]
			},
			{label:['Тверь: 13'],
			backgroundColor:'#51574a',
			data:[{'x':0.0197774778949,'y':0.171849012826,'r':65}]
			},
			{label:['Тейково: 5'],
			backgroundColor:'#c94a53',
			data:[{'x':0.759983987682,'y':0.951520070907,'r':25}]
			},
			{label:['Тель-Авив: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.897265180768,'y':0.913964898249,'r':5}]
			},
			{label:['Тирасполь: 3'],
			backgroundColor:'#be5168',
			data:[{'x':0.130255702862,'y':0.0537614822341,'r':15}]
			},
			{label:['Тихвин: 2'],
			backgroundColor:'#a34974',
			data:[{'x':0.00758218624,'y':0.812785046563,'r':10}]
			},
			{label:['Тобольск: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.129880788377,'y':0.910731423969,'r':10}]
			},
			{label:['Толбазы: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.953894703542,'y':0.564425257108,'r':5}]
			},
			{label:['Толвуя: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.893888055149,'y':0.96954789221,'r':5}]
			},
			{label:['Тольятти: 7'],
			backgroundColor:'#65387d',
			data:[{'x':0.617890965261,'y':0.968012349172,'r':35}]
			},
			{label:['Томск: 7'],
			backgroundColor:'#e0598b',
			data:[{'x':0.42990417609,'y':0.624134255007,'r':35}]
			},
			{label:['Топки: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.215026427708,'y':0.428591452893,'r':5}]
			},
			{label:['Торжок: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.857384494115,'y':0.382795140631,'r':10}]
			},
			{label:['Тосно: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.363610836344,'y':0.0637282007421,'r':5}]
			},
			{label:['Туапсе: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.851556722527,'y':0.166642639412,'r':5}]
			},
			{label:['Тула: 14'],
			backgroundColor:'#e2975d',
			data:[{'x':0.0878910565305,'y':0.911118917285,'r':70}]
			},
			{label:['Тутаев: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.339866529509,'y':0.478439858152,'r':5}]
			},
			{label:['Тюмень: 23'],
			backgroundColor:'#e16552',
			data:[{'x':0.600391769397,'y':0.790053023192,'r':115}]
			},
			{label:['Уварово: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.971505263476,'y':0.015608821527,'r':10}]
			},
			{label:['Уват: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.0360591861054,'y':0.398718301708,'r':5}]
			},
			{label:['Углич: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0874636358015,'y':0.668605878786,'r':10}]
			},
			{label:['Удальцово: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.746402824428,'y':0.395900888423,'r':5}]
			},
			{label:['Улан-Удэ: 4'],
			backgroundColor:'#74c493',
			data:[{'x':0.601171361112,'y':0.109357775518,'r':20}]
			},
			{label:['Ульяновск: 11'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.759077874365,'y':0.051338674367,'r':55}]
			},
			{label:['Уральск: 3'],
			backgroundColor:'#e16552',
			data:[{'x':0.67137153048,'y':0.67086464782,'r':15}]
			},
			{label:['Уржум: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.866787395997,'y':0.0478021456689,'r':5}]
			},
			{label:['Урюпинск: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.133466435998,'y':0.994163406324,'r':5}]
			},
			{label:['Уссурийск: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.481844121506,'y':0.884939649749,'r':10}]
			},
			{label:['Усть-Тарка: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.12656997079,'y':0.0493898698775,'r':5}]
			},
			{label:['Уфа: 24'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.337308909508,'y':0.203195411717,'r':120}]
			},
			{label:['Ухта: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.119926612421,'y':0.756943504648,'r':5}]
			},
			{label:['Феодосия: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.80689262712,'y':0.868461393496,'r':5}]
			},
			{label:['Фрязино: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.1,'y':0.112504811807,'r':10}]
			},
			{label:['Хабаровск: 6'],
			backgroundColor:'#4e2472',
			data:[{'x':0.88649809369,'y':0.678679669972,'r':30}]
			},
			{label:['Харьков: 12'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0598783811817,'y':0.446163664914,'r':60}]
			},
			{label:['Херсон: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.889573723999,'y':0.0418108128075,'r':5}]
			},
			{label:['Химки: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0081766325679,'y':0.79869766751,'r':5}]
			},
			{label:['Хойники: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.523741749567,'y':0.306699287797,'r':5}]
			},
			{label:['Чайковский: 3'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.514496431941,'y':0.0883665574476,'r':15}]
			},
			{label:['Чебаркуль: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.399383318134,'y':0.924905131294,'r':5}]
			},
			{label:['Чебоксары: 10'],
			backgroundColor:'#4e2472',
			data:[{'x':0.472964538284,'y':0.950835314801,'r':50}]
			},
			{label:['Челябинск: 41'],
			backgroundColor:'#be5168',
			data:[{'x':0.529342805575,'y':0.262316534533,'r':205}]
			},
			{label:['Череповец: 11'],
			backgroundColor:'#be5168',
			data:[{'x':0.316865178258,'y':0.555310059485,'r':55}]
			},
			{label:['Черкассы: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.997235107321,'y':0.231847416264,'r':5}]
			},
			{label:['Чернигов: 2'],
			backgroundColor:'#a34974',
			data:[{'x':0.660240998836,'y':0.0524805252082,'r':10}]
			},
			{label:['Черновцы: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.245001253946,'y':0.292991000526,'r':10}]
			},
			{label:['Черноморское: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.0844275156499,'y':0.562288672115,'r':5}]
			},
			{label:['Чернушка: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.624674290528,'y':0.392210826809,'r':5}]
			},
			{label:['Чехов: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.685064694812,'y':0.140664979133,'r':10}]
			},
			{label:['Чик: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.724467936811,'y':0.283990776322,'r':5}]
			},
			{label:['Чита: 8'],
			backgroundColor:'#be5168',
			data:[{'x':0.335545760273,'y':0.597611030919,'r':40}]
			},
			{label:['Шадринск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.839727340389,'y':0.401788315498,'r':5}]
			},
			{label:['Шатура: 2'],
			backgroundColor:'#447c69',
			data:[{'x':0.852145831447,'y':0.296751918995,'r':10}]
			},
			{label:['Шебекино: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.453327680946,'y':0.591114519296,'r':5}]
			},
			{label:['Шексна: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.819757922282,'y':0.527755606088,'r':5}]
			},
			{label:['Шелехов: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.00767677826902,'y':0.0509896678077,'r':5}]
			},
			{label:['Шугозеро: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.0833449029095,'y':0.748214366624,'r':5}]
			},
			{label:['Шумерля: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.0622525278471,'y':0.723523243724,'r':10}]
			},
			{label:['Шумиха: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0225313181069,'y':0.88823743281,'r':5}]
			},
			{label:['Шымкент: 3'],
			backgroundColor:'#5698c4',
			data:[{'x':0.879697126706,'y':0.0701954630343,'r':15}]
			},
			{label:['Щомыслица: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.521713788077,'y':0.146122303015,'r':5}]
			},
			{label:['Щёлково: 3'],
			backgroundColor:'#e279a3',
			data:[{'x':0.0671318229163,'y':0.680629045887,'r':15}]
			},
			{label:['Экибастуз: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.99603810579,'y':0.799373624229,'r':5}]
			},
			{label:['Электросталь: 4'],
			backgroundColor:'#e0598b',
			data:[{'x':0.232897038347,'y':0.983121654048,'r':20}]
			},
			{label:['Элиста: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.921990258561,'y':0.406836906051,'r':5}]
			},
			{label:['Эльбрус: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.402160553307,'y':0.716010224525,'r':5}]
			},
			{label:['Энгельс: 4'],
			backgroundColor:'#e2975d',
			data:[{'x':0.387315321688,'y':0.223788253775,'r':20}]
			},
			{label:['Югорск: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.516429571263,'y':0.457300153093,'r':5}]
			},
			{label:['Южноуральск: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.582790292159,'y':0.539508904702,'r':5}]
			},
			{label:['Юрга: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.478051355936,'y':0.184727074881,'r':5}]
			},
			{label:['Якутск: 7'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.246014527589,'y':0.83249808866,'r':35}]
			},
			{label:['Ялта: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.898300427832,'y':0.626558473584,'r':5}]
			},
			{label:['Яр: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.931094489647,'y':0.773495273456,'r':5}]
			},
			{label:['Ярославль: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.688058538388,'y':0.566880280426,'r':15}]
			},
			{label:['Antalya: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.633442807376,'y':0.585454302035,'r':5}]
			},
			{label:['Bat Yam: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.520723500391,'y':0.838511406643,'r':5}]
			},
			{label:['Bergamo: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.1885949778,'y':0.0421392007327,'r':5}]
			},
			{label:['Berlin: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.480672158003,'y':0.711379247968,'r':5}]
			},
			{label:['Boston: 3'],
			backgroundColor:'#993767',
			data:[{'x':0.328067500138,'y':0.132294922386,'r':15}]
			},
			{label:['Bridgetown: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.554770152632,'y':0.997029400683,'r':5}]
			},
			{label:['Brugge: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.305052214138,'y':0.888802614835,'r':5}]
			},
			{label:['Buenos Aires: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.855036760049,'y':0.71384495304,'r':5}]
			},
			{label:['California: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.945500186985,'y':0.646495646864,'r':5}]
			},
			{label:['Detroit: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.392962039585,'y':0.430661628279,'r':10}]
			},
			{label:['Doha: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.35776811565,'y':0.930385252692,'r':5}]
			},
			{label:['Eindhoven: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.3134836923,'y':0.546644359363,'r':5}]
			},
			{label:['Formentera de Segura: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.383754104089,'y':0.105956809926,'r':5}]
			},
			{label:['Frankfurt am Main: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.291513643324,'y':0.92645229992,'r':10}]
			},
			{label:['Gaborone: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.362473994157,'y':0.772009221951,'r':5}]
			},
			{label:['Helsingborg: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.866270843103,'y':0.00638321686367,'r':5}]
			},
			{label:['Helsinki: 2'],
			backgroundColor:'#4e2472',
			data:[{'x':0.902007554672,'y':0.403617502098,'r':10}]
			},
			{label:['London: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.231280492833,'y':0.785347981169,'r':10}]
			},
			{label:['Los Angeles: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.0721408490173,'y':0.0716190161828,'r':5}]
			},
			{label:['Luanda: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.929208795658,'y':0.726231395268,'r':5}]
			},
			{label:['Madaba: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.97972520083,'y':0.747501226304,'r':5}]
			},
			{label:['Madrid: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.943773871541,'y':0.431532356793,'r':5}]
			},
			{label:['Manchester: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.289810975522,'y':0.816404244824,'r':5}]
			},
			{label:['Miami: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.808698460287,'y':0.0696684556655,'r':5}]
			},
			{label:['New York City: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.900928963611,'y':0.661096908623,'r':5}]
			},
			{label:['Nîmes: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.885364344539,'y':0.468977311931,'r':5}]
			},
			{label:['Oslo: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.938605185932,'y':0.727012613227,'r':5}]
			},
			{label:['Philadelphia: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.319311766659,'y':0.149553082057,'r':5}]
			},
			{label:['Rio de Janeiro: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.580701507848,'y':0.995391596343,'r':5}]
			},
			{label:['Rīga: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.137965820858,'y':0.26303809781,'r':5}]
			},
			{label:['Saarbrücken: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.183448911939,'y':0.460377593908,'r':5}]
			},
			{label:['Salzburg: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.429875854324,'y':0.799267160199,'r':5}]
			},
			{label:['Santa Monica: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.917464515427,'y':0.446598580671,'r':5}]
			},
			{label:['Sderot: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.89790467137,'y':0.357865304624,'r':5}]
			},
			{label:['Sevilla: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.574058318247,'y':0.468468583351,'r':5}]
			},
			{label:['Stockholm: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.664157539129,'y':0.0903785829492,'r':5}]
			},
			{label:['Sydney: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.0645195948137,'y':0.992521220731,'r':5}]
			},
			{label:['São Paulo: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.297778404008,'y':0.618232904245,'r':5}]
			},
			{label:['Tirana: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.492779141296,'y':0.714201035804,'r':5}]
			},
			{label:['Tokyo: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.335346983957,'y':0.533470900674,'r':5}]
			},
			{label:['Vilnius: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.821826644071,'y':0.116099868564,'r':5}]
			},
			{label:['Wilhelmshaven: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.384432671802,'y':0.388915572393,'r':5}]
			},
			{label:['Wrocław: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.628875088166,'y':0.0482999557478,'r':5}]
			},
			{label:['Würzburg: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.935486085127,'y':0.113503471279,'r':5}]
			}																	
		],
		options: {
			title: {
			  display: true,
			  text: 'Города группы VK Бег 2.0'
			},
			tooltips: {
				cornerRadius: 0,
				caretSize: 0,
				xPadding: 16,
				yPadding: 10,
				backgroundColor: 'rgba(0, 150, 100, 0.9)',
				titleFontStyle: 'normal',
				titleMarginBottom: 15
			  }			
		}		
	}
});