const CITIES = document.getElementById("cch");

Chart.defaults.global.animation.duration = 3000;
Chart.defaults.scale.ticks.beginAtZero = true;


let cities_chart = new Chart(CITIES, {
    type: 'bubble',
	data: {
		datasets: [
			{label:['Нарьян-Мар: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.506187930976,'y':0.394756185472,'r':5}]
			},
			{label:['Балахна: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.381023950528,'y':0.952817482239,'r':5}]
			},
			{label:['Würzburg: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.9,'y':0.782695855615,'r':5}]
			},
			{label:['Астрахань: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.493539507783,'y':0.419320140018,'r':5}]
			},
			{label:['Солнечногорск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.943369337404,'y':0.748245638766,'r':5}]
			},
			{label:['Тверь: 4'],
			backgroundColor:'#74c493',
			data:[{'x':0.312062011128,'y':0.182113224272,'r':20}]
			},
			{label:['Питер: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.70425008011,'y':0.112732324824,'r':5}]
			},
			{label:['Красногорск: 3'],
			backgroundColor:'#a34974',
			data:[{'x':0.570882502617,'y':0.623136529243,'r':15}]
			},
			{label:['Королёв: 2'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.4801516695,'y':0.389150237909,'r':10}]
			},
			{label:['Калининград: 11'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.419470045858,'y':0.818997089663,'r':55}]
			},
			{label:['Владивосток: 4'],
			backgroundColor:'#5698c4',
			data:[{'x':0.318383006718,'y':0.0819550489309,'r':20}]
			},
			{label:['Железнодорожный (Балашиха): 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.0339285845366,'y':0.219697345991,'r':5}]
			},
			{label:['Кривой Рог: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.542852423481,'y':0.881593941442,'r':10}]
			},
			{label:['Чайковский: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.754580617956,'y':0.371441959999,'r':5}]
			},
			{label:['Ковдор: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.355313162306,'y':0.275863548559,'r':5}]
			},
			{label:['Алушта: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.35333086723,'y':0.307995789298,'r':5}]
			},
			{label:['Сергиев Посад: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.846712271091,'y':0.678471888193,'r':5}]
			},
			{label:['Москва: 173'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.53465272436,'y':0.175987846465,'r':173}]
			},
			{label:['Домодедово: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.122909445154,'y':0.656133823805,'r':10}]
			},
			{label:['Ликино-Дулево: 3'],
			backgroundColor:'#f19670',
			data:[{'x':0.326678924346,'y':0.934099978054,'r':15}]
			},
			{label:['Вельск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.249657509034,'y':0.0337167102834,'r':5}]
			},
			{label:['Одесса: 3'],
			backgroundColor:'#5698c4',
			data:[{'x':0.139390249846,'y':0.723501417919,'r':15}]
			},
			{label:['Березники: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.719224443714,'y':0.896893213351,'r':10}]
			},
			{label:['Bat Yam: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.546238480313,'y':0.132389816547,'r':5}]
			},
			{label:['Балашиха: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.604626190606,'y':0.919297613345,'r':10}]
			},
			{label:['Иркутск: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.978488466138,'y':0.788096762842,'r':5}]
			},
			{label:['Урюпинск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.272189057467,'y':0.30916541513,'r':5}]
			},
			{label:['Лангепас: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.561291666778,'y':0.469448786976,'r':5}]
			},
			{label:['Зайсан: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.335198516809,'y':0.0249940296208,'r':5}]
			},
			{label:['Ставрополь: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.863489437839,'y':0.00624193154829,'r':10}]
			},
			{label:['Волосово: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.285528890161,'y':0.926363624059,'r':5}]
			},
			{label:['Старый Оскол: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.216645110932,'y':0.696732011899,'r':10}]
			},
			{label:['Чебоксары: 4'],
			backgroundColor:'#65387d',
			data:[{'x':0.834368691561,'y':0.0806658634377,'r':20}]
			},
			{label:['Ростов-на-Дону: 8'],
			backgroundColor:'#51574a',
			data:[{'x':0.529772481378,'y':0.660529015067,'r':40}]
			},
			{label:['Ковров: 2'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.684840976204,'y':0.981475777055,'r':10}]
			},
			{label:['Барнаул: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.40972397846,'y':0.420770601041,'r':10}]
			},
			{label:['Электросталь: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.0560480743643,'y':0.845720961815,'r':10}]
			},
			{label:['Балаково: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.424263529117,'y':0.259009961028,'r':5}]
			},
			{label:['Уварово: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.0810645925935,'y':0.123500916595,'r':5}]
			},
			{label:['Балтийск: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.945667989022,'y':0.882494211011,'r':5}]
			},
			{label:['Дзержинск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.777161646593,'y':0.190828735493,'r':5}]
			},
			{label:['Севастополь: 5'],
			backgroundColor:'#e279a3',
			data:[{'x':0.653923363201,'y':0.626133044647,'r':25}]
			},
			{label:['Курск: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.787672851011,'y':0.42131091257,'r':5}]
			},
			{label:['Мурманск: 8'],
			backgroundColor:'#be5168',
			data:[{'x':0.878517155533,'y':0.0613364467138,'r':40}]
			},
			{label:['Уссурийск: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0136063732476,'y':0.113740031008,'r':5}]
			},
			{label:['Gaborone: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.624545374428,'y':0.362049244524,'r':5}]
			},
			{label:['Брест: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.851951137239,'y':0.980313760436,'r':5}]
			},
			{label:['Омск: 3'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.0250527879924,'y':0.652582988572,'r':15}]
			},
			{label:['Липецк: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.392809677994,'y':0.550605101046,'r':10}]
			},
			{label:['Полевской: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.00598234351456,'y':0.99,'r':5}]
			},
			{label:['Орёл: 2'],
			backgroundColor:'#5698c4',
			data:[{'x':0.10546367571,'y':0.504642550943,'r':10}]
			},
			{label:['Люберцы: 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.780613672233,'y':0.398454689467,'r':10}]
			},
			{label:['Гродно: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.859188503991,'y':0.651107891525,'r':5}]
			},
			{label:['Дубна: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.544423122012,'y':0.598686324942,'r':5}]
			},
			{label:['Владимир: 3'],
			backgroundColor:'#5698c4',
			data:[{'x':0.932111838721,'y':0.662327379841,'r':15}]
			},
			{label:['Пенза: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.530182469726,'y':0.433275790796,'r':5}]
			},
			{label:['Челябинск: 21'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.903778404544,'y':0.295689196757,'r':105}]
			},
			{label:['Рыбинск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.317330964138,'y':0.179465180948,'r':5}]
			},
			{label:['Мирный: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.740666832853,'y':0.901558243612,'r':10}]
			},
			{label:['Саратов: 11'],
			backgroundColor:'#c94a53',
			data:[{'x':0.152334719294,'y':0.758444918015,'r':55}]
			},
			{label:['Пинск: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.850893957996,'y':0.439318678495,'r':5}]
			},
			{label:['Белгород: 8'],
			backgroundColor:'#4e2472',
			data:[{'x':0.157913671093,'y':0.210030582747,'r':40}]
			},
			{label:['Львов: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.945471482197,'y':0.6563070292,'r':5}]
			},
			{label:['Камышин: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.579188534618,'y':0.0711909686236,'r':5}]
			},
			{label:['Лосино-Петровский: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.522871837329,'y':0.214855994244,'r':5}]
			},
			{label:['Краснознаменск: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.764313777952,'y':0.232874098725,'r':10}]
			},
			{label:['Мончегорск: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.258115859824,'y':0.640036688337,'r':5}]
			},
			{label:['Сланцы: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.386353059701,'y':0.559011474175,'r':10}]
			},
			{label:['Тольятти: 7'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0475789643918,'y':0.321158111238,'r':35}]
			},
			{label:['Стаханов: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.6695131888,'y':0.0469544101824,'r':5}]
			},
			{label:['Тосно: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.471119986305,'y':0.548114706629,'r':5}]
			},
			{label:['Новосибирск: 13'],
			backgroundColor:'#f19670',
			data:[{'x':0.13,'y':0.85,'r':65}]
			},
			{label:['Северодвинск: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.680323000788,'y':0.558416399837,'r':5}]
			},
			{label:['Топки: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.0821613586786,'y':0.632615271143,'r':5}]
			},
			{label:['Ижевск: 6'],
			backgroundColor:'#5698c4',
			data:[{'x':0.257687757155,'y':0.080499638902,'r':30}]
			},
			{label:['Сухой Лог: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.0868286627354,'y':0.414329327453,'r':5}]
			},
			{label:['Тирасполь: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.401598772406,'y':0.986976967739,'r':10}]
			},
			{label:['Калуга: 3'],
			backgroundColor:'#993767',
			data:[{'x':0.827256380993,'y':0.9,'r':15}]
			},
			{label:['Бердск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.346009678958,'y':0.705321344599,'r':5}]
			},
			{label:['Краснодон: 4'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.204747881608,'y':0.859895111072,'r':20}]
			},
			{label:['Череповец: 3'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.245953372802,'y':0.287072617118,'r':15}]
			},
			{label:['Лобня: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.325323548794,'y':0.150626214588,'r':5}]
			},
			{label:['Ноябрьск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.423099485366,'y':0.457195541227,'r':5}]
			},
			{label:['Кумертау: 3'],
			backgroundColor:'#e0598b',
			data:[{'x':0.998,'y':0.244604360745,'r':15}]
			},
			{label:['Псков: 4'],
			backgroundColor:'#e2975d',
			data:[{'x':0.664324021308,'y':0.358034135821,'r':20}]
			},
			{label:['Нижневартовск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.590368038836,'y':0.138324774487,'r':5}]
			},
			{label:['Пушкин: 2'],
			backgroundColor:'#e16552',
			data:[{'x':0.810744039457,'y':0.520884099993,'r':10}]
			},
			{label:['Ревда: 2'],
			backgroundColor:'#993767',
			data:[{'x':0.914837422297,'y':0.0248546689633,'r':10}]
			},
			{label:['Толбазы: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.187539933024,'y':0.177317276204,'r':5}]
			},
			{label:['Сызрань: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.438803437312,'y':0.497433786818,'r':5}]
			},
			{label:['Снегири: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.845681997248,'y':0.924809120521,'r':5}]
			},
			{label:['Химки: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.145749693842,'y':0.173737438976,'r':5}]
			},
			{label:['New York City: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.772427169393,'y':0.806645683152,'r':5}]
			},
			{label:['Копейск: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.846098183924,'y':0.156212050305,'r':5}]
			},
			{label:['Запорожье: 2'],
			backgroundColor:'#9163b6',
			data:[{'x':0.243294845462,'y':0.858395325913,'r':10}]
			},
			{label:['Данилов: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.775249371924,'y':0.22008462474,'r':5}]
			},
			{label:['Saarbrücken: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.27521936615,'y':0.469367438415,'r':5}]
			},
			{label:['Helsinki: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.0576255952364,'y':0.281330486286,'r':10}]
			},
			{label:['Петрозаводск: 4'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.560751111505,'y':0.497170077506,'r':20}]
			},
			{label:['Шелехов: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.652538201142,'y':0.922428569657,'r':5}]
			},
			{label:['Ливны: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0144972555317,'y':0.0437089133045,'r':5}]
			},
			{label:['Сыктывкар: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.015994772449,'y':0.645410046222,'r':5}]
			},
			{label:['Энгельс: 1'],
			backgroundColor:'#5698c4',
			data:[{'x':0.449810955887,'y':0.377796188792,'r':5}]
			},
			{label:['Георгиевск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.814424147683,'y':0.626899047111,'r':5}]
			},
			{label:['Воронеж: 6'],
			backgroundColor:'#e16552',
			data:[{'x':0.630849664759,'y':0.542480204128,'r':30}]
			},
			{label:['Сочи: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.392356201187,'y':0.735898813388,'r':5}]
			},
			{label:['London: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.507205087627,'y':0.613518205932,'r':5}]
			},
			{label:['Магнитогорск: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.218392051482,'y':0.758288112814,'r':5}]
			},
			{label:['Шумерля: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.328778157942,'y':0.190897824688,'r':5}]
			},
			{label:['Шатура: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.0485280383572,'y':0.7472123644,'r':5}]
			},
			{label:['Лахденпохья: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.025183875305,'y':0.279199478825,'r':5}]
			},
			{label:['Бабаево: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.236792620179,'y':0.974926075141,'r':5}]
			},
			{label:['Чехов: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.929570859796,'y':0.984095905085,'r':5}]
			},
			{label:['Кстово: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.366067963442,'y':0.294657044374,'r':5}]
			},
			{label:['Йошкар-Ола: 2'],
			backgroundColor:'#9abf88',
			data:[{'x':0.202852007058,'y':0.0491966542896,'r':10}]
			},
			{label:['Краснодар: 8'],
			backgroundColor:'#e0598b',
			data:[{'x':0.238644851823,'y':0.867416412307,'r':40}]
			},
			{label:['Саранск: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.00925241617364,'y':0.47320198221,'r':5}]
			},
			{label:['Магадан: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.00886835314585,'y':0.495709055758,'r':5}]
			},
			{label:['Luanda: 1'],
			backgroundColor:'#e0598b',
			data:[{'x':0.61690245915,'y':0.627118840094,'r':5}]
			},
			{label:['Дмитров: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.524184088154,'y':0.813442240233,'r':5}]
			},
			{label:['Орехово-Зуево: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.213193977803,'y':0.671691175802,'r':10}]
			},
			{label:['Курган: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.588797369328,'y':0.606289372555,'r':5}]
			},
			{label:['Красноярск: 6'],
			backgroundColor:'#be5168',
			data:[{'x':0.95139170012,'y':0.277152440736,'r':30}]
			},
			{label:['Смоленск: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.61769075854,'y':0.736847691192,'r':10}]
			},
			{label:['Томск: 2'],
			backgroundColor:'#c94a53',
			data:[{'x':0.0635563349818,'y':0.219234830804,'r':10}]
			},
			{label:['Павловский Посад: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.745106952284,'y':0.619834331304,'r':5}]
			},
			{label:['Пермь: 5'],
			backgroundColor:'#a34974',
			data:[{'x':0.915393435158,'y':0.616647248898,'r':25}]
			},
			{label:['Крестцы: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.123085813381,'y':0.916256387063,'r':5}]
			},
			{label:['Среднеуральск: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.779092127631,'y':0.318325191414,'r':10}]
			},
			{label:['Елабуга: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.447438007786,'y':0.387767980026,'r':5}]
			},
			{label:['Сумы: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.822114817835,'y':0.730999607151,'r':5}]
			},
			{label:['Зеленоград: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.242900611367,'y':0.0796309452029,'r':10}]
			},
			{label:['Хабаровск: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.391623941382,'y':0.303766978587,'r':15}]
			},
			{label:['Тюкалинск: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.341079997148,'y':0.808463097845,'r':5}]
			},
			{label:['Оренбург: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.081362832583,'y':0.769994136669,'r':5}]
			},
			{label:['Рязань: 5'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.67289532979,'y':0.943514063484,'r':25}]
			},
			{label:['Волгоград: 4'],
			backgroundColor:'#944f88',
			data:[{'x':0.163657617538,'y':0.583663349798,'r':20}]
			},
			{label:['Брянск: 2'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.528618963624,'y':0.56128047568,'r':10}]
			},
			{label:['Набережные Челны: 4'],
			backgroundColor:'#51574a',
			data:[{'x':0.499879168539,'y':0.200152978658,'r':20}]
			},
			{label:['Селятино: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.209474978185,'y':0.647738824889,'r':5}]
			},
			{label:['Улан-Удэ: 2'],
			backgroundColor:'#65387d',
			data:[{'x':0.467526813196,'y':0.695357574278,'r':10}]
			},
			{label:['Витебск: 1'],
			backgroundColor:'#e16552',
			data:[{'x':0.945255816218,'y':0.27112190223,'r':5}]
			},
			{label:['Вологда: 4'],
			backgroundColor:'#e4b780',
			data:[{'x':0.94,'y':0.4,'r':20}]
			},
			{label:['Выборг: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.485230586969,'y':0.36,'r':5}]
			},
			{label:['Киржач: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.663818588864,'y':0.0562012297648,'r':5}]
			},
			{label:['Нововоронеж: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.809652442871,'y':0.781430950783,'r':5}]
			},
			{label:['Ярославль: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.255899905865,'y':0.478587968695,'r':5}]
			},
			{label:['Агинское: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.76583363944,'y':0.1391648248,'r':5}]
			},
			{label:['Лесной: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0258873807033,'y':0.37402043929,'r':5}]
			},
			{label:['Тюмень: 14'],
			backgroundColor:'#a34974',
			data:[{'x':0.71819625258,'y':0.655514661713,'r':70}]
			},
			{label:['Людиново: 2'],
			backgroundColor:'#be5168',
			data:[{'x':0.275954962871,'y':0.911068733233,'r':10}]
			},
			{label:['Архангельск: 3'],
			backgroundColor:'#f19670',
			data:[{'x':0.348692224549,'y':0.645189981421,'r':15}]
			},
			{label:['Оханск: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.139412961194,'y':0.984857888734,'r':5}]
			},
			{label:['Уральск: 2'],
			backgroundColor:'#74c493',
			data:[{'x':0.530130869782,'y':0.862409189674,'r':10}]
			},
			{label:['Formentera de Segura: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.275187232085,'y':0.857882586572,'r':5}]
			},
			{label:['Волжский: 1'],
			backgroundColor:'#f19670',
			data:[{'x':0.738808227195,'y':0.407630588292,'r':5}]
			},
			{label:['Заречное: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.737509892279,'y':0.0238577034147,'r':5}]
			},
			{label:['Апатиты: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.264611234712,'y':0.340648561117,'r':5}]
			},
			{label:['Раменское: 1'],
			backgroundColor:'#447c69',
			data:[{'x':0.575163693698,'y':0.127742254617,'r':5}]
			},
			{label:['Абакан: 2'],
			backgroundColor:'#e2975d',
			data:[{'x':0.44263661314,'y':0.618622439638,'r':10}]
			},
			{label:['Казань: 6'],
			backgroundColor:'#5698c4',
			data:[{'x':0.812958772867,'y':0.586089534084,'r':30}]
			},
			{label:['Шугозеро: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.368788146054,'y':0.13376783864,'r':5}]
			},
			{label:['Алексин: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.846483999875,'y':0.271164004631,'r':5}]
			},
			{label:['Нижний Новгород: 19'],
			backgroundColor:'#e2975d',
			data:[{'x':0.0829598082726,'y':0.445230172432,'r':95}]
			},
			{label:['Санкт-Петербург: 143'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0275510971302,'y':0.622034049937,'r':143}]
			},
			{label:['Мелеуз: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.228364294939,'y':0.81567414151,'r':5}]
			},
			{label:['Алеховщина: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.470930780855,'y':0.76802327806,'r':5}]
			},
			{label:['Щомыслица: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.934701170484,'y':0.938424694876,'r':5}]
			},
			{label:['Якутск: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.593068085345,'y':0.870468832171,'r':5}]
			},
			{label:['Кострома: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.874850249552,'y':0.155966032422,'r':5}]
			},
			{label:['Дружковка: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.307034354526,'y':0.916714730252,'r':5}]
			},
			{label:['Тобольск: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.993778855269,'y':0.767935005228,'r':5}]
			},
			{label:['Кемерово: 2'],
			backgroundColor:'#e0598b',
			data:[{'x':0.136374817195,'y':0.808594789321,'r':10}]
			},
			{label:['Сибай: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.752387947587,'y':0.0191334092287,'r':5}]
			},
			{label:['Николаев: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.992158402959,'y':0.186617586453,'r':5}]
			},
			{label:['Киров: 5'],
			backgroundColor:'#9163b6',
			data:[{'x':0.358027713074,'y':0.0909782058207,'r':25}]
			},
			{label:['Гатчина: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.894374148586,'y':0.165036163312,'r':5}]
			},
			{label:['Новочебоксарск: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.0109029674436,'y':0.204283088901,'r':5}]
			},
			{label:['Алматы: 3'],
			backgroundColor:'#9163b6',
			data:[{'x':0.801161903493,'y':0.0480290707071,'r':15}]
			},
			{label:['Вязьма: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0986902380435,'y':0.0155722742518,'r':5}]
			},
			{label:['Ростов: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.661408696508,'y':0.401949331908,'r':5}]
			},
			{label:['Луховицы: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.197328080975,'y':0.90872698078,'r':5}]
			},
			{label:['Ульяновск: 4'],
			backgroundColor:'#9163b6',
			data:[{'x':0.445584871344,'y':0.402351759139,'r':20}]
			},
			{label:['Иваново: 3'],
			backgroundColor:'#9163b6',
			data:[{'x':0.0864623761767,'y':0.173312760934,'r':15}]
			},
			{label:['Воркута: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.558830527486,'y':0.304030289419,'r':5}]
			},
			{label:['Уфа: 3'],
			backgroundColor:'#51574a',
			data:[{'x':0.181215624044,'y':0.917650630479,'r':15}]
			},
			{label:['Симферополь: 4'],
			backgroundColor:'#a34974',
			data:[{'x':0.908615109726,'y':0.524959464305,'r':20}]
			},
			{label:['Manchester: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.888769012372,'y':0.885024318728,'r':5}]
			},
			{label:['Сегежа: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.977316053231,'y':0.986651457515,'r':5}]
			},
			{label:['Караганда: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.661675951676,'y':0.155380722545,'r':5}]
			},
			{label:['Альметьевск: 1'],
			backgroundColor:'#e2975d',
			data:[{'x':0.370252991879,'y':0.0481719014986,'r':5}]
			},
			{label:['Харьков: 6'],
			backgroundColor:'#9163b6',
			data:[{'x':0.204573427459,'y':0.114767693337,'r':30}]
			},
			{label:['Пудож: 1'],
			backgroundColor:'#9abf88',
			data:[{'x':0.573671229531,'y':0.430083532566,'r':5}]
			},
			{label:['Октябрьский: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.99434910263,'y':0.638470190185,'r':5}]
			},
			{label:['Екатеринбург: 22'],
			backgroundColor:'#9abf88',
			data:[{'x':0.15,'y':0.503893110564,'r':110}]
			},
			{label:['Кириши: 3'],
			backgroundColor:'#65387d',
			data:[{'x':0.285629214445,'y':0.264093888302,'r':15}]
			},
			{label:['Щёлково: 3'],
			backgroundColor:'#9163b6',
			data:[{'x':0.678180812592,'y':0.382757975433,'r':15}]
			},
			{label:['Анапа: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.0258181260683,'y':0.9,'r':10}]
			},
			{label:['Малин: 1'],
			backgroundColor:'#65387d',
			data:[{'x':0.969562135238,'y':0.409873319521,'r':5}]
			},
			{label:['Киев: 4'],
			backgroundColor:'#f19670',
			data:[{'x':0.481013491818,'y':0.862779236766,'r':20}]
			},
			{label:['Шексна: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.982921838773,'y':0.0655943109983,'r':5}]
			},
			{label:['Новокузнецк: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.552845464391,'y':0.836222671612,'r':5}]
			},
			{label:['Верхнедвинск: 1'],
			backgroundColor:'#be5168',
			data:[{'x':0.0670297997415,'y':0.409163406531,'r':5}]
			},
			{label:['Минск: 5'],
			backgroundColor:'#be5168',
			data:[{'x':0.159339466918,'y':0.925372938344,'r':25}]
			},
			{label:['Большие Колпаны: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.663878586323,'y':0.633790800095,'r':5}]
			},
			{label:['Медвежий Угол: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.173696250879,'y':0.439159523388,'r':5}]
			},
			{label:['Навашино: 1'],
			backgroundColor:'#8e8c6d',
			data:[{'x':0.946203953666,'y':0.685001779403,'r':5}]
			},
			{label:['Спасское: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.600064189326,'y':0.664331032193,'r':5}]
			},
			{label:['Нижний Тагил: 2'],
			backgroundColor:'#51574a',
			data:[{'x':0.415105767933,'y':0.222476451471,'r':10}]
			},
			{label:['Актобе: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.288396371459,'y':0.834403557895,'r':5}]
			},
			{label:['Златоуст: 2'],
			backgroundColor:'#f19670',
			data:[{'x':0.251387367956,'y':0.605609615004,'r':10}]
			},
			{label:['Ришон ЛеЦион: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.668928701409,'y':0.732537160412,'r':5}]
			},
			{label:['Северская: 1'],
			backgroundColor:'#51574a',
			data:[{'x':0.434118371201,'y':0.276936651436,'r':5}]
			},
			{label:['Тихвин: 1'],
			backgroundColor:'#4e2472',
			data:[{'x':0.437860734271,'y':0.73741727075,'r':5}]
			},
			{label:['Тула: 7'],
			backgroundColor:'#447c69',
			data:[{'x':0.48239398671,'y':0.767739447405,'r':35}]
			},
			{label:['Костомукша: 7'],
			backgroundColor:'#51574a',
			data:[{'x':0.70037370606,'y':0.53621111116,'r':35}]
			},
			{label:['Нижнекамск: 1'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.0571412099035,'y':0.381757916333,'r':5}]
			},
			{label:['Мытищи: 1'],
			backgroundColor:'#a34974',
			data:[{'x':0.997494426029,'y':0.746265383424,'r':5}]
			},
			{label:['Солигорск: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.269413844042,'y':0.669450953839,'r':5}]
			},
			{label:['Wilhelmshaven: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.960671383495,'y':0.340448425957,'r':5}]
			},
			{label:['Коломна: 3'],
			backgroundColor:'#e4bf80',
			data:[{'x':0.540638720597,'y':0.640499471542,'r':15}]
			},
			{label:['Саки: 1'],
			backgroundColor:'#c94a53',
			data:[{'x':0.779547021407,'y':0.118875397999,'r':5}]
			},
			{label:['Брянка: 1'],
			backgroundColor:'#9163b6',
			data:[{'x':0.570744188663,'y':0.399825016308,'r':5}]
			},
			{label:['Кагул: 1'],
			backgroundColor:'#e9d78e',
			data:[{'x':0.53157936401,'y':0.271050153779,'r':5}]
			},
			{label:['Брехово: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.0282712441135,'y':0.112915580941,'r':5}]
			},
			{label:['Донецк: 3'],
			backgroundColor:'#e2975d',
			data:[{'x':0.519245538073,'y':0.796243622158,'r':15}]
			},
			{label:['Boston: 1'],
			backgroundColor:'#993767',
			data:[{'x':0.113099817894,'y':0.17319742841,'r':5}]
			},
			{label:['Тамбов: 1'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.0286304687678,'y':0.95771654511,'r':5}]
			},
			{label:['Сосновый Бор: 1'],
			backgroundColor:'#e279a3',
			data:[{'x':0.50304626595,'y':0.566846221045,'r':5}]
			},
			{label:['Самара: 10'],
			backgroundColor:'#7c9fb0',
			data:[{'x':0.457513803535,'y':0.68693347467,'r':50}]
			},
			{label:['Знаменск: 1'],
			backgroundColor:'#74c493',
			data:[{'x':0.529479718056,'y':0.547116068679,'r':5}]
			}										
		],
		options: {
			title: {
			  display: true,
			  text: 'Города группы VK Бег 2.0'
			},
			tooltips: {
				cornerRadius: 0,
				caretSize: 0,
				xPadding: 16,
				yPadding: 10,
				backgroundColor: 'rgba(0, 150, 100, 0.9)',
				titleFontStyle: 'normal',
				titleMarginBottom: 15
			  }			
		}		
	}
});